# import re
# import numpy as np
# import tensorflow as tf
# from tensorflow.keras.preprocessing.text import Tokenizer
# from tensorflow.keras.preprocessing.sequence import pad_sequences
# from tensorflow.keras.models import Sequential
# from tensorflow.keras.layers import Embedding, LSTM, Dense
# import gradio as gr

# data='''
# वृक्ष हों भले खड़े,
# हों घने हों बड़े,
# एक पत्र छाँह भी,
# माँग मत, माँग मत, माँग मत,
# अग्निपथ अग्निपथ अग्निपथ।
# तू न थकेगा कभी, तू न रुकेगा कभी,
# तू न मुड़ेगा कभी,
# कर शपथ, कर शपथ, कर शपथ,
# अग्निपथ अग्निपथ अग्निपथ।
# यह महान दृश्य है,
# चल रहा मनुष्य है,
# अश्रु श्वेत रक्त से,
# लथपथ लथपथ लथपथ,
# अग्निपथ अग्निपथ अग्निपथ।
# नीड़ का निर्माण फिर-फिर,
# नेह का आह्णान फिर-फिर।
# वह उठी आँधी कि नभ में
# छा गया सहसा अँधेरा,
# धूलि धूसर बादलों ने
# भूमि को इस भाँति घेरा,
# रात-सा दिन हो गया, फिर
# रात आ‌ई और काली,
# लग रहा था अब न होगा
# इस निशा का फिर सवेरा,
# रात के उत्पात-भय से
# भीत जन-जन, भीत कण-कण
# किंतु प्राची से उषा की
# मोहिनी मुस्कान फिर-फिर
# नीड़ का निर्माण फिर-फिर,
# नेह का आह्णान फिर-फिर।
# वह चले झोंके कि काँपे
# भीम कायावान भूधर,
# जड़ समेत उखड़-पुखड़कर
# गिर पड़े, टूटे विटप वर,
# हाय, तिनकों से विनिर्मित
# घोंसलो पर क्या न बीती,
# डगमगा‌ए जबकि कंकड़,
# ईंट, पत्थर के महल-घर
# बोल आशा के विहंगम,
# किस जगह पर तू छिपा था,
# जो गगन पर चढ़ उठाता
# गर्व से निज तान फिर-फिर
# नीड़ का निर्माण फिर-फिर,
# नेह का आह्णान फिर-फिर।
# क्रुद्ध नभ के वज्र दंतों
# में उषा है मुसकराती,
# घोर गर्जनमय गगन के
# कंठ में खग पंक्ति गाती;
# एक चिड़िया चोंच में तिनका
# लि‌ए जो जा रही है,
# वह सहज में ही पवन
# उंचास को नीचा दिखाती
# नाश के दुख से कभी
# दबता नहीं निर्माण का सुख
# प्रलय की निस्तब्धता से
# सृष्टि का नव गान फिर-फिर
# नीड़ का निर्माण फिर-फिर,
# नेह का आह्णान फिर-फिर।
# पूर्व चलने के बटोही, बाट की पहचान कर ले
# पुस्तकों में है नहीं छापी गई इसकी कहानी,
# हाल इसका ज्ञात होता है न औरों की जबानी,
# अनगिनत राही गए इस राह से, उनका पता क्या,
# पर गए कुछ लोग इस पर छोड़ पैरों की निशानी,
# यह निशानी मूक होकर भी बहुत कुछ बोलती है,
# खोल इसका अर्थ, पंथी, पंथ का अनुमान कर ले।
# पूर्व चलने के बटोही, बाट की पहचान कर ले।
# है अनिश्चित किस जगह पर सरित, गिरि, गह्वर मिलेंगे,
# है अनिश्चित किस जगह पर बाग वन सुंदर मिलेंगे,
# किस जगह यात्रा खतम हो जाएगी, यह भी अनिश्चित,
# है अनिश्चित कब सुमन, कब कंटकों के शर मिलेंगे
# कौन सहसा छूट जाएँगे, मिलेंगे कौन सहसा,
# आ पड़े कुछ भी, रुकेगा तू न, ऐसी आन कर ले।
# पूर्व चलने के बटोही, बाट की पहचान कर ले।
# कौन कहता है कि स्वप्नों को न आने दे हृदय में,
# देखते सब हैं इन्हें अपनी उमर, अपने समय में,
# और तू कर यत्न भी तो, मिल नहीं सकती सफलता,
# ये उदय होते लिए कुछ ध्येय नयनों के निलय में,
# किंतु जग के पंथ पर यदि, स्वप्न दो तो सत्य दो सौ,
# स्वप्न पर ही मुग्ध मत हो, सत्य का भी ज्ञान कर ले।
# पूर्व चलने के बटोही, बाट की पहचान कर ले।
# स्वप्न आता स्वर्ग का, दृग-कोरकों में दीप्ति आती,
# पंख लग जाते पगों को, ललकती उन्मुक्त छाती,
# रास्ते का एक काँटा, पाँव का दिल चीर देता,
# रक्त की दो बूँद गिरतीं, एक दुनिया डूब जाती,
# आँख में हो स्वर्ग लेकिन, पाँव पृथ्वी पर टिके हों,
# कंटकों की इस अनोखी सीख का सम्मान कर ले।
# पूर्व चलने के बटोही, बाट की पहचान कर ले।
# यह बुरा है या कि अच्छा, व्यर्थ दिन इस पर बिताना,
# अब असंभव छोड़ यह पथ दूसरे पर पग बढ़ाना,
# तू इसे अच्छा समझ, यात्रा सरल इससे बनेगी,
# सोच मत केवल तुझे ही यह पड़ा मन में बिठाना,
# हर सफल पंथी यही विश्वास ले इस पर बढ़ा है,
# तू इसी पर आज अपने चित्त का अवधान कर ले।
# पूर्व चलने के बटोही, बाट की पहचान कर ले।
# चल मरदाने, सीना ताने,
# हाथ हिलाते, पांव बढाते,
# मन मुस्काते, गाते गीत ।
# एक हमारा देश, हमारा
# वेश, हमारी कौम, हमारी
# मंज़िल, हम किससे भयभीत ।
# चल मरदाने, सीना ताने,
# हाथ हिलाते, पांव बढाते,
# मन मुस्काते, गाते गीत ।
# हम भारत की अमर जवानी,
# सागर की लहरें लासानी,
# गंग-जमुन के निर्मल पानी,
# हिमगिरि की ऊंची पेशानी
# सबके प्रेरक, रक्षक, मीत ।
# चल मरदाने, सीना ताने,
# हाथ हिलाते, पांव बढाते,
# मन मुस्काते, गाते गीत ।
# जग के पथ पर जो न रुकेगा,
# जो न झुकेगा, जो न मुडेगा,
# उसका जीवन, उसकी जीत ।
# चल मरदाने, सीना ताने,
# हाथ हिलाते, पांव बढाते,
# मन मुस्काते, गाते गीत ।
# मानव पर जगती का शासन,
# जगती पर संसृति का बंधन,
# संसृति को भी और किसी के प्रतिबंधों में रहना होगा!
# साथी, सब कुछ सहना होगा!
# हम क्या हैं जगती के सर में!
# जगती क्या, संसृति सागर में!
# एक प्रबल धारा में हमको लघु तिनके-सा बहना होगा!
# साथी, सब कुछ सहना होगा!
# आओ, अपनी लघुता जानें,
# अपनी निर्बलता पहचानें,
# जैसे जग रहता आया है उसी तरह से रहना होगा!
# साथी, सब कुछ सहना होगा!
# मैं जग-जीवन का भार लिए फिरता हूँ,
# फिर भी जीवन में प्‍यार लिए फिरता हूँ
# कर दिया किसी ने झंकृत जिनको छूकर
# मैं सासों के दो तार लिए फिरता हूँ!
# मैं स्‍नेह-सुरा का पान किया करता हूँ,
# मैं कभी न जग का ध्‍यान किया करता हूँ,
# जग पूछ रहा है उनको, जो जग की गाते,
# मैं अपने मन का गान किया करता हूँ!
# मैं निज उर के उद्गार लिए फिरता हूँ,
# मैं निज उर के उपहार लिए फिरता हूँ
# है यह अपूर्ण संसार ने मुझको भाता
# मैं स्‍वप्‍नों का संसार लिए फिरता हूँ!
# मैं जला हृदय में अग्नि, दहा करता हूँ,
# सुख-दुख दोनों में मग्‍न रहा करता हूँ
# जग भ्‍ाव-सागर तरने को नाव बनाए,
# मैं भव मौजों पर मस्‍त बहा करता हूँ!
# मैं यौवन का उन्‍माद लिए फिरता हूँ,
# उन्‍मादों में अवसाद लए फिरता हूँ,
# जो मुझको बाहर हँसा, रुलाती भीतर,
# मैं, हाय, किसी की याद लिए फिरता हूँ!
# कर यत्‍न मिटे सब, सत्‍य किसी ने जाना?
# नादन वहीं है, हाय, जहाँ पर दाना
# फिर मूढ़ न क्‍या जग, जो इस पर भी सीखे?
# मैं सीख रहा हूँ, सीखा ज्ञान भूलना!
# मैं और, और जग और, कहाँ का नाता,
# मैं बना-बना कितने जग रोज़ मिटाता
# जग जिस पृथ्‍वी पर जोड़ा करता वैभव,
# मैं प्रति पग से उस पृथ्‍वी को ठुकराता!
# मैं निज रोदन में राग लिए फिरता हूँ,
# शीतल वाणी में आग लिए फिरता हूँ,
# हों जिसपर भूपों के प्रसाद निछावर,
# मैं उस खंडर का भाग लिए फिरता हूँ!
# मैं रोया, इसको तुम कहते हो गाना,
# मैं फूट पड़ा, तुम कहते, छंद बनाना
# क्‍यों कवि कहकर संसार मुझे अपनाए,
# मैं दुनिया का हूँ एक नया दीवाना!
# मैं दीवानों का एक वेश लिए फिरता हूँ,
# मैं मादकता नि:शेष लिए फिरता हूँ
# जिसको सुनकर जग झूम, झुके, लहराए,
# मैं मस्‍ती का संदेश लिए फिरता हूँ!
# क्या करूँ संवेदना ले कर तुम्हारी ?
# क्या करूँ ?
# मैं दुःखी जब-जब हुआ
# संवेदना तुमने दिखाई,
# मैं कृतज्ञ हुआ हमेशा
# रीति दोनों ने निभाई,
# किंतु इस आभार का अब
# हो उठा है बोझ भारी
# क्या करूँ संवेदना ले कर तुम्हारी ?
# क्या करूँ ?
# एक भी उच्छ्वास मेरा
# हो सका किस दिन तुम्हारा?
# उस नयन से बह सकी कब
# इस नयन की अश्रु-धारा?
# सत्य को मूँदे रहेगी
# शब्द की कब तक पिटारी?
# क्या करूँ संवेदना ले कर तुम्हारी?
# क्या करूँ?
# कौन है जो दूसरे को
# दुःख अपना दे सकेगा?
# कौन है जो दूसरे से
# दुःख उसका ले सकेगा?
# क्यों हमारे बीच धोखे
# का रहे व्यापार जारी?
# क्या करूँ संवेदना ले कर तुम्हारी?
# क्या करूँ?
# क्यों न हम लें मान, हम हैं
# चल रहे ऐसी डगर पर,
# हर पथिक जिस पर अकेला,
# दुःख नहीं बँटते परस्पर,
# दूसरों की वेदना में
# वेदना जो है दिखाता,
# वेदना से मुक्ति का निज
# हर्ष केवल वह छिपाता,
# तुम दुःखी हो तो सुखी मैं
# विश्व का अभिशाप भारी!
# क्या करूँ संवेदना ले कर तुम्हारी?
# क्या करूँ?
# हो जाय न पथ में रात कहीं,
# मंजिल भी तो है दूर नहीं –
# यह सोच थका दिन का पंथी भी जल्दी-जल्दी चलता है!
# दिन जल्दी-जल्दी ढलता है!
# बच्चे प्रत्याशा में होंगे,
# नीड़ों से झाँक रहे होंगे –
# यह ध्यान परों में चिड़ियों के भरता कितनी चंचलता है!
# दिन जल्दी-जल्दी ढलता है!
# मुझसे मिलने को कौन विकल?
# मैं होऊँ किसके हित चंचल? –
# यह प्रश्न शिथिल करता पद को, भरता उर में विह्वलता है!
# दिन जल्दी-जल्दी ढलता है!
# हा, तुम्हारी मृदुल इच्छा!
# हाय, मेरी कटु अनिच्छा!
# था बहुत माँगा ना तुमने किन्तु वह भी दे ना पाया!
# था तुम्हें मैंने रुलाया!
# स्नेह का वह कण तरल था,
# मधु न था, न सुधा-गरल था,
# एक क्षण को भी, सरलते, क्यों समझ तुमको न पाया!
# था तुम्हें मैंने रुलाया!
# बूँद कल की आज सागर,
# सोचता हूँ बैठ तट पर –
# क्यों अभी तक डूब इसमें कर न अपना अंत पाया!
# था तुम्हें मैंने रुलाया!
# जीवन में एक सितारा था
# माना वह बेहद प्यारा था
# वह डूब गया तो डूब गया
# अंबर के आंगन को देखो
# कितने इसके तारे टूटे
# कितने इसके प्यारे छूटे
# जो छूट गए फिर कहाँ मिले
# पर बोलो टूटे तारों पर
# कब अंबर शोक मनाता है
# जो बीत गई सो बात गई
# जीवन में वह था एक कुसुम
# थे उस पर नित्य निछावर तुम
# वह सूख गया तो सूख गया
# मधुबन की छाती को देखो
# सूखीं कितनी इसकी कलियाँ
# मुरझाईं कितनी वल्लरियाँ
# जो मुरझाईं फिर कहाँ खिलीं
# पर बोलो सूखे फूलों पर
# कब मधुबन शोर मचाता है
# जो बीत गई सो बात गई
# जीवन में मधु का प्याला था
# तुमने तन मन दे डाला था
# वह टूट गया तो टूट गया
# मदिरालय का आँगन देखो
# कितने प्याले हिल जाते हैं
# गिर मिट्टी में मिल जाते हैं
# जो गिरते हैं कब उठते हैं
# पर बोलो टूटे प्यालों पर
# कब मदिरालय पछताता है
# जो बीत गई सो बात गई
# मृदु मिट्टी के बने हुए
# मधु घट फूटा ही करते हैं
# लघु जीवन ले कर आए हैं
# प्याले टूटा ही करते हैं
# फ़िर भी मदिरालय के अन्दर
# मधु के घट हैं, मधु प्याले हैं
# जो मादकता के मारे हैं
# वे मधु लूटा ही करते हैं
# वह कच्चा पीने वाला है
# जिसकी ममता घट प्यालों पर
# जो सच्चे मधु से जला हुआ
# कब रोता है चिल्लाता है
# जो बीत गई सो बात गई
# जीवन की आपाधापी में कब वक्त मिला
# कुछ देर कहीं पर बैठ कभी यह सोच सकूँ
# जो किया, कहा, माना उसमें क्या बुरा भला।
# जिस दिन मेरी चेतना जगी मैंने देखा
# मैं खड़ा हुआ हूँ इस दुनिया के मेले में,
# हर एक यहाँ पर एक भुलाने में भूला
# हर एक लगा है अपनी अपनी दे-ले में
# कुछ देर रहा हक्का-बक्का, भौचक्का-सा,
# आ गया कहाँ, क्या करूँ यहाँ, जाऊँ किस जा?
# फिर एक तरफ से आया ही तो धक्का-सा
# मैंने भी बहना शुरू किया उस रेले में,
# क्या बाहर की ठेला-पेली ही कुछ कम थी,
# जो भीतर भी भावों का ऊहापोह मचा, जो किया,
# उसी को करने की मजबूरी थी,
# जो कहा, वही मन के अंदर से उबल चला,
# जीवन की आपाधापी में कब वक्त मिला
# कुछ देर कहीं पर बैठ कभी यह सोच सकूँ
# जो किया, कहा, माना उसमें क्या बुरा भला।
# मेला जितना भड़कीला रंग-रंगीला था,
# मानस के अन्दर उतनी ही कमजोरी थी,
# जितना ज्यादा संचित करने की ख्वाहिश थी,
# उतनी ही छोटी अपने कर की झोरी थी,
# जितनी ही बिरमे रहने की थी अभिलाषा,
# उतना ही रेले तेज ढकेले जाते थे,
# क्रय-विक्रय तो ठण्ढे दिल से हो सकता है,
# यह तो भागा-भागी की छीना-छोरी थी;
# अब मुझसे पूछा जाता है क्या बतलाऊँ
# क्या मान अकिंचन बिखराता पथ पर आया,
# वह कौन रतन अनमोल मिला ऐसा मुझको,
# जिस पर अपना मन प्राण निछावर कर आया,
# यह थी तकदीरी बात मुझे गुण दोष न दो
# जिसको समझा था सोना, वह मिट्टी निकली,
# जिसको समझा था आँसू, वह मोती निकला।
# जीवन की आपाधापी में कब वक़्त मिला
# कुछ देर कहीं पर बैठ कभी यह सोच सकूँ
# जो किया, कहा, माना उसमें क्या बुरा भला।
# मैं कितना ही भूलूँ, भटकूँ या भरमाऊँ,
# है एक कहीं मंज़िल जो मुझे बुलाती है,
# कितने ही मेरे पाँव पड़े ऊँचे-नीचे,
# प्रतिपल वह मेरे पास चली ही आती है,
# मुझ पर विधि का आभार बहुत-सी बातों का।
# पर मैं कृतज्ञ उसका इस पर सबसे ज़्यादा –
# नभ ओले बरसाए, धरती शोले उगले,
# अनवरत समय की चक्की चलती जाती है,
# मैं जहाँ खड़ा था कल उस थल पर आज नहीं,
# कल इसी जगह पर पाना मुझको मुश्किल है,
# ले मापदंड जिसको परिवर्तित कर देतीं
# केवल छूकर ही देश-काल की सीमाएँ
# जग दे मुझपर फैसला उसे जैसा भाए
# लेकिन मैं तो बेरोक सफ़र में जीवन के
# इस एक और पहलू से होकर निकल चला।
# जीवन की आपाधापी में कब वक़्त मिला
# कुछ देर कहीं पर बैठ कभी यह सोच सकूँ
# जो किया, कहा, माना उसमें क्या बुरा भला।
# अर्द्ध रात्रि में सहसा उठकर,
# पलक संपुटों में मदिरा भर,
# तुमने क्यों मेरे चरणों में अपना तन-मन वार दिया था?
# क्षण भर को क्यों प्यार किया था ?
# ‘यह अधिकार कहाँ से लाया’
# और न कुछ मैं कहने पाया –
# मेरे अधरों पर निज अधरों का तुमने रख भार दिया था!
# क्षण भर को क्यों प्यार किया था ?
# वह क्षण अमर हुआ जीवन में,
# आज राग जो उठता मन में –
# यह प्रतिध्वनि उसकी जो उर में तुमने भर उद्गार दिया था!
# क्षण भर को क्यों प्यार किया था ?
# प्राण, कह दो, आज तुम मेरे लिए हो।
# मैं जगत के ताप से डरता नहीं अब,
# मैं समय के शाप से डरता नहीं अब,
# आज कुंतल छाँह मुझ पर तुम किए हो
# प्राण, कह दो, आज तुम मेरे लिए हो।
# रात मेरी, रात का श्रृंगार मेरा,
# आज आधे विश्व से अभिसार मेरा,
# तुम मुझे अधिकार अधरों पर दिए हो
# प्राण, कह दो, आज तुम मेरे लिए हो।
# वह सुरा के रूप से मोहे भला क्या,
# वह सुधा के स्वाद से जाए छला क्या,
# जो तुम्हारे होंठ का मधु-विष पिए हो
# प्राण, कह दो, आज तुम मेरे लिए हो।
# मृत-सजीवन था तुम्हारा तो परस ही,
# पा गया मैं बाहु का बंधन सरस भी,
# मैं अमर अब, मत कहो केवल जिए हो
# प्राण, कह दो, आज तुम मेरे लिए हो।
# आ रही रवि की सवारी।
# नव-किरण का रथ सजा है,
# कलि-कुसुम से पथ सजा है,
# बादलों-से अनुचरों ने स्‍वर्ण की पोशाक धारी।
# आ रही रवि की सवारी।
# विहग, बंदी और चारण,
# गा रही है कीर्ति-गायन,
# छोड़कर मैदान भागी, तारकों की फ़ौज सारी।
# आ रही रवि की सवारी।
# चाहता, उछलूँ विजय कह,
# पर ठिठकता देखकर यह-
# रात का राजा खड़ा है, राह में बनकर भिखारी।
# आ रही रवि की सवारी।
# व्यर्थ उसे है ज्ञान सिखाना,
# व्यर्थ उसे दर्शन समझाना,
# उसके दुख से दुखी नहीं हो तो बस दूर रहो !
# दुखी मन से कुछ भी न कहो !
# उसके नयनों का जल खारा,
# है गंगा की निर्मल धारा,
# पावन कर देगी तन-मन को क्षण भर साथ बहो !
# दुखी मन से कुछ भी न कहो !
# देन बड़ी सबसे यह विधि की,
# है समता इससे किस निधि की ?
# दुखी दुखी को कहो, भूल कर उसे न दीन कहो ?
# दुखी मन से कुछ भी न कहो !
# पूर्ण कर विश्वास जिसपर,
# हाथ मैं जिसका पकड़कर,
# था चला, जब शत्रु बन बैठा हृदय का गीत,
# मैंने मान ली तब हार
# विश्व ने बातें चतुर कर,
# चित्त जब उसका लिया हर,
# मैं रिझा जिसको न पाया गा सरल मधुगीत,
# मैंने मान ली तब हार
# विश्व ने कंचन दिखाकर
# कर लिया अधिकार उसपर,
# मैं जिसे निज प्राण देकर भी न पाया जीत,
# मैंने मान ली तब हार
# मृदु भावों के अंगूरों की आज बना लाया हाला,
# प्रियतम, अपने ही हाथों से आज पिलाऊँगा प्याला,
# पहले भोग लगा लूँ तेरा फिर प्रसाद जग पाएगा,
# सबसे पहले तेरा स्वागत करती मेरी मधुशाला।
# प्यास तुझे तो, विश्व तपाकर पूर्ण निकालूँगा हाला,
# एक पाँव से साकी बनकर नाचूँगा लेकर प्याला,
# जीवन की मधुता तो तेरे ऊपर कब का वार चुका,
# आज निछावर कर दूँगा मैं तुझ पर जग की मधुशाला।
# प्रियतम, तू मेरी हाला है, मैं तेरा प्यासा प्याला,
# अपने को मुझमें भरकर तू बनता है पीनेवाला,
# मैं तुझको छक छलका करता, मस्त मुझे पी तू होता,
# एक दूसरे की हम दोनों आज परस्पर मधुशाला।
# भावुकता अंगूर लता से खींच कल्पना की हाला,
# कवि साकी बनकर आया है भरकर कविता का प्याला,
# कभी न कण-भर खाली होगा लाख पिएँ, दो लाख पिएँ!
# पाठकगण हैं पीनेवाले, पुस्तक मेरी मधुशाला।
# मधुर भावनाओं की सुमधुर नित्य बनाता हूँ हाला,
# भरता हूँ इस मधु से अपने अंतर का प्यासा प्याला,
# उठा कल्पना के हाथों से स्वयं उसे पी जाता हूँ,
# अपने ही में हूँ मैं साकी, पीनेवाला, मधुशाला।
# मदिरालय जाने को घर से चलता है पीनेवाला,
# ‘किस पथ से जाऊँ?’ असमंजस में है वह भोलाभाला,
# अलग-अलग पथ बतलाते सब पर मैं यह बतलाता हूँ –
# ‘राह पकड़ तू एक चला चल, पा जाएगा मधुशाला।
# चलने ही चलने में कितना जीवन, हाय, बिता डाला!
# ‘दूर अभी है’, पर, कहता है हर पथ बतलाने वाला,
# हिम्मत है न बढूँ आगे को साहस है न फिरुँ पीछे,
# किंकर्तव्यविमूढ़ मुझे कर दूर खड़ी है मधुशाला।
# मुख से तू अविरत कहता जा मधु, मदिरा, मादक हाला,
# हाथों में अनुभव करता जा एक ललित कल्पित प्याला,
# ध्यान किए जा मन में सुमधुर सुखकर, सुंदर साकी का,
# और बढ़ा चल, पथिक, न तुझको दूर लगेगी मधुशाला।
# मदिरा पीने की अभिलाषा ही बन जाए जब हाला,
# अधरों की आतुरता में ही जब आभासित हो प्याला,
# बने ध्यान ही करते-करते जब साकी साकार, सखे,
# रहे न हाला, प्याला, साकी, तुझे मिलेगी मधुशाला।
# सुन, कलकल़ , छलछल़ मधुघट से गिरती प्यालों में हाला,
# सुन, रूनझुन रूनझुन चल वितरण करती मधु साकीबाला,
# बस आ पहुंचे, दुर नहीं कुछ, चार कदम अब चलना है,
# चहक रहे, सुन, पीनेवाले, महक रही, ले, मधुशाला।
# जलतरंग बजता, जब चुंबन करता प्याले को प्याला,
# वीणा झंकृत होती, चलती जब रूनझुन साकीबाला,
# डाँट डपट मधुविक्रेता की ध्वनित पखावज करती है,
# मधुरव से मधु की मादकता और बढ़ाती मधुशाला।
# मेहंदी रंजित मृदुल हथेली पर माणिक मधु का प्याला,
# अंगूरी अवगुंठन डाले स्वर्ण वर्ण साकीबाला,
# पाग बैंजनी, जामा नीला डाट डटे पीनेवाले,
# इन्द्रधनुष से होड़ लगाती आज रंगीली मधुशाला।
# हाथों में आने से पहले नाज़ दिखाएगा प्याला,
# अधरों पर आने से पहले अदा दिखाएगी हाला,
# बहुतेरे इनकार करेगा साकी आने से पहले,
# पथिक, न घबरा जाना, पहले मान करेगी मधुशाला।
# लाल सुरा की धार लपट सी कह न इसे देना ज्वाला,
# फेनिल मदिरा है, मत इसको कह देना उर का छाला,
# दर्द नशा है इस मदिरा का विगत स्मृतियाँ साकी हैं,
# पीड़ा में आनंद जिसे हो, आए मेरी मधुशाला।
# जगती की शीतल हाला सी पथिक, नहीं मेरी हाला,
# जगती के ठंडे प्याले सा पथिक, नहीं मेरा प्याला,
# ज्वाल सुरा जलते प्याले में दग्ध हृदय की कविता है,
# जलने से भयभीत न जो हो, आए मेरी मधुशाला।
# बहती हाला देखी, देखो लपट उठाती अब हाला,
# देखो प्याला अब छूते ही होंठ जला देनेवाला,
# ‘होंठ नहीं, सब देह दहे, पर पीने को दो बूंद मिले
# ऐसे मधु के दीवानों को आज बुलाती मधुशाला।
# धर्मग्रन्थ सब जला चुकी है, जिसके अंतर की ज्वाला,
# मंदिर, मसजिद, गिरिजे, सब को तोड़ चुका जो मतवाला,
# पंडित, मोमिन, पादिरयों के फंदों को जो काट चुका,
# कर सकती है आज उसी का स्वागत मेरी मधुशाला।
# लालायित अधरों से जिसने, हाय, नहीं चूमी हाला,
# हर्ष-विकंपित कर से जिसने, हा, न छुआ मधु का प्याला,
# हाथ पकड़ लज्जित साकी को पास नहीं जिसने खींचा,
# व्यर्थ सुखा डाली जीवन की उसने मधुमय मधुशाला।
# बने पुजारी प्रेमी साकी, गंगाजल पावन हाला,
# रहे फेरता अविरत गति से मधु के प्यालों की माला
# ‘और लिये जा, और पीये जा’, इसी मंत्र का जाप करे
# मैं शिव की प्रतिमा बन बैठूं, मंदिर हो यह मधुशाला।
# बजी न मंदिर में घड़ियाली, चढ़ी न प्रतिमा पर माला,
# बैठा अपने भवन मुअज्ज़िन देकर मस्जिद में ताला,
# लुटे ख़जाने नरपितयों के गिरीं गढ़ों की दीवारें,
# रहें मुबारक पीनेवाले, खुली रहे यह मधुशाला।
# लहर सागर का नहीं श्रृंगार,
# उसकी विकलता है;
# अनिल अम्बर का नहीं खिलवार
# उसकी विकलता है;
# विविध रूपों में हुआ साकार,
# रंगो में सुरंजित,
# मृत्तिका का यह नहीं संसार,
# उसकी विकलता है।
# गन्ध कलिका का नहीं उदगार,
# उसकी विकलता है;
# फूल मधुवन का नहीं गलहार,
# उसकी विकलता है;
# कोकिला का कौन सा व्यवहार,
# ऋतुपति को न भाया?
# कूक कोयल की नहीं मनुहार,
# उसकी विकलता है।
# गान गायक का नहीं व्यापार,
# उसकी विकलता है;
# राग वीणा की नहीं झंकार,
# उसकी विकलता है;
# भावनाओं का मधुर आधार
# सांसो से विनिर्मित,
# गीत कवि-उर का नहीं उपहार,
# उसकी विकलता है।
# मुझे न अपने से कुछ प्यार,
# मिट्टी का हूँ, छोटा दीपक,
# ज्योति चाहती, दुनिया जब तक,
# मेरी, जल-जल कर मैं उसको देने को तैयार।
# पर यदि मेरी लौ के द्वार,
# दुनिया की आँखों को निद्रित,
# चकाचौध करते हों छिद्रित
# मुझे बुझा दे बुझ जाने से मुझे नहीं इंकार।
# केवल इतना ले वह जान
# मिट्टी के दीपों के अंतर
# मुझमें दिया प्रकृति ने है कर
# मैं सजीव दीपक हूँ मुझ में भरा हुआ है मान।
# पहले कर ले खूब विचार
# तब वह मुझ पर हाथ बढ़ाए
# कहीं न पीछे से पछताए
# बुझा मुझे फिर जला सकेगी नहीं दूसरी बार।
# प्यार किसी को करना लेकिन
# कह कर उसे बताना क्या
# अपने को अर्पण करना पर
# और को अपनाना क्या।
# गुण का ग्राहक बनना लेकिन
# गा कर उसे सुनाना क्या
# मन के कल्पित भावों से
# औरों को भ्रम में लाना क्या।
# ले लेना सुगंध सुमनों की
# तोड उन्हे मुरझाना क्या
# प्रेम हार पहनाना लेकिन
# प्रेम पाश फैलाना क्या।
# त्याग अंक में पले प्रेम शिशु
# उनमें स्वार्थ बताना क्या
# दे कर हृदय हृदय पाने की
# आशा व्यर्थ लगाना क्या।
# छोड़ घोंसला बाहर आया,
# देखी डालें, देखे पात,
# और सुनी जो पत्‍ते हिलमिल,
# करते हैं आपस में बात;-
# माँ, क्‍या मुझको उड़ना आया?
# 'नहीं, चुरूगुन, तू भरमाया'
# डाली से डाली पर पहुँचा,
# देखी कलियाँ, देखे फूल,
# ऊपर उठकर फुनगी जानी,
# नीचे झूककर जाना मूल;-
# माँ, क्‍या मुझको उड़ना आया?
# 'नहीं, चुरूगुन, तू भरमाया'
# कच्‍चे-पक्‍के फल पहचाने,
# खए और गिराए काट,
# खने-गाने के सब साथी,
# देख रहे हैं मेरी बाट;-
# माँ, क्‍या मुझको उड़ना आया?
# 'नहीं, चुरूगुन, तू भरमाया'
# उस तरू से इस तरू पर आता,
# जाता हूँ धरती की ओर,
# दाना कोई कहीं पड़ा हो
# चुन लाता हूँ ठोक-ठठोर;
# माँ, क्‍या मुझको उड़ना आया?
# 'नहीं, चुरूगुन, तू भरमाया'
# मैं नीले अज्ञात गगन की
# सुनता हूँ अनिवार पुकार
# कोइ अंदर से कहता है
# उड़ जा, उड़ता जा पर मार;-
# माँ, क्‍या मुझको उड़ना आया?
# 'आज सुफल हैं तेरे डैने,
# आज सुफल है तेरी काया'
# आ रही रवि की सवारी।
# नव-किरण का रथ सजा है,
# कलि-कुसुम से पथ सजा है,
# बादलों-से अनुचरों ने स्‍वर्ण की पोशाक धारी।
# आ रही रवि की सवारी।
# विहग, बंदी और चारण,
# गा रही है कीर्ति-गायन,
# छोड़कर मैदान भागी, तारकों की फ़ौज सारी।
# आ रही रवि की सवारी।
# चाहता, उछलूँ विजय कह,
# पर ठिठकता देखकर यह-
# रात का राजा खड़ा है, राह में बनकर भिखारी।
# आ रही रवि की सवारी।
# गीत मेरे, देहरी का दीप-सा बन।
# एक दुनिया है हृदय में, मानता हूँ,
# वह घिरी तम से, इसे भी जानता हूँ,
# छा रहा है किंतु बाहर भी तिमिर-घन,
# गीत मेरे, देहरी का द‍ीप-सा बन।
# प्राण की लौ से तुझे जिस काल बारुँ,
# और अपने कंठ पर तुझको सँवारूँ,
# कह उठे संसार, आया ज्‍योति का क्षण,
# गीत मेरे, देहरी का द‍ीप-सा बन।
# दूर कर मुझमें भरी तू कालिमा जब,
# फैल जाए विश्‍व में भी लालिमा तब,
# जानता सीमा नहीं है अग्नि का कण,
# गीत मेरे, देहरी का द‍ीप-सा बन।
# जग विभामय न तो काली रात मेरी,
# मैं विभामय तो नहीं जगती अँधेरी,
# यह रहे विश्‍वास मेरा यह रहे प्रण,
# गीत मेरे, देहरी का द‍ीप-सा बन।
# रात का-सा था अंधेरा,
# बादलों का था न डेरा,
# किन्तु फिर भी चन्द्र-तारों से हुआ था हीन अम्बर!
# स्वप्न था मेरा भयंकर!
# क्षीण सरिता बह रही थी,
# कूल से यह कह रही थी-
# शीघ्र ही मैं सूखने को, भेंट ले मुझको हृदय भर!
# स्वप्न था मेरा भयंकर!
# धार से कुछ फासले पर
# सिर कफ़न की ओढ चादर
# एक मुर्दा गा रहा था बैठकर जलती चिता पर!
# स्वप्न था मेरा भयंकर!
# सोचा करता बैठ अकेले,
# गत जीवन के सुख-दुख झेले,
# दंशनकारी सुधियों से मैं उर के छाले सहलाता हूँ!
# ऐसे मैं मन बहलाता हूँ!
# नहीं खोजने जाता मरहम,
# होकर अपने प्रति अति निर्मम,
# उर के घावों को आँसू के खारे जल से नहलाता हूँ!
# ऐसे मैं मन बहलाता हूँ!
# आह निकल मुख से जाती है,
# मानव की ही तो छाती है,
# लाज नहीं मुझको देवों में यदि मैं दुर्बल कहलाता हूँ!
# ऐसे मैं मन बहलाता हूँ!
# बादल, पीले रजकण,
# सूखे पत्ते, रूखे तृण घन
# लेकर चलता करता 'हरहर'--इसका गान समझ पाओगे?
# तुम तूफान समझ पाओगे ?
# गंध-भरा यह मंद पवन था,
# लहराता इससे मधुवन था,
# सहसा इसका टूट गया जो स्वप्न महान, समझ पाओगे?
# तुम तूफान समझ पाओगे ?
# तोड़-मरोड़ विटप-लतिकाएँ,
# नोच-खसोट कुसुम-कलिकाएँ,
# जाता है अज्ञात दिशा को ! हटो विहंगम, उड़ जाओगे !
# तुम तूफान समझ पाओगे ?
# इतने मत उन्‍मत्‍त बनो!
# जीवन मधुशाला से मधु पी
# बनकर तन-मन-मतवाला,
# गीत सुनाने लगा झूमकर
# चुम-चुमकर मैं प्‍याला-
# शीश हिलाकर दुनिया बोली,
# पृथ्‍वी पर हो चुका बहुत यह,
# इतने मत उन्‍मत्‍त बनो।
# इतने मत संतप्‍त बनो।
# जीवन मरघट पर अपने सब
# आमानों की कर होली,
# चला राह में रोदन करता
# चिता-राख से भर झोली-
# शीश हिलाकर दुनिया बोली,
# पृथ्‍वी पर हो चुका बहुत यह,
# इतने मत संतप्‍त बनो।
# इतने मत उत्‍तप्‍त बनो।
# मेरे प्रति अन्‍याय हुआ है
# ज्ञात हुआ मुझको जिस क्षण,
# करने लगा अग्नि-आनन हो
# गुरू-गर्जन, गुरूतर गर्जन-
# शीश हिलाकर दुनिया बोली,
# पृथ्‍वी पर हो चुका बहुत यह,
# इतने मत उत्‍तप्‍त बनो।
# त्राहि, त्राहि कर उठता जीवन!
# जब रजनी के सूने क्षण में,
# तन-मन के एकाकीपन में
# कवि अपनी विव्हल वाणी से अपना व्याकुल मन बहलाता,
# त्राहि, त्राहि कर उठता जीवन!
# जब उर की पीडा से रोकर,
# फिर कुछ सोच समझ चुप होकर
# विरही अपने ही हाथों से अपने आंसू पोंछ हटाता,
# त्राहि, त्राहि कर उठता जीवन!
# पंथी चलते-चलते थक कर,
# बैठ किसी पथ के पत्थर पर
# जब अपने ही थकित करों से अपना विथकित पांव दबाता,
# त्राहि, त्राहि कर उठता जीवन!
# लहरों से डर कर नौका पार नहीं होती
# कोशिश करने वालों की हार नहीं होती।
# नन्हीं चींटी जब दाना लेकर चलती है
# चढ़ती दीवारों पर, सौ बार फिसलती है
# मन का विश्वास रगों में साहस भरता है
# चढ़कर गिरना, गिरकर चढ़ना न अखरता है
# आख़िर उसकी मेहनत बेकार नहीं होती
# कोशिश करने वालों की हार नहीं होती।
# डुबकियां सिंधु में गोताखोर लगाता है
# जा जा कर खाली हाथ लौटकर आता है
# मिलते नहीं सहज ही मोती गहरे पानी में
# बढ़ता दुगना उत्साह इसी हैरानी में
# मुट्ठी उसकी खाली हर बार नहीं होती
# कोशिश करने वालों की हार नहीं होती।
# असफलता एक चुनौती है, स्वीकार करो
# क्या कमी रह गई, देखो और सुधार करो
# जब तक न सफल हो, नींद चैन को त्यागो तुम
# संघर्ष का मैदान छोड़ मत भागो तुम
# कुछ किये बिना ही जय जय कार नहीं होती
# कोशिश करने वालों की हार नहीं होती।
# इसी घर से
# एक दिन
# शहीद का जनाज़ा निकला था,
# तिरंगे में लिपटा,
# हज़ारों की भीड़ में।
# काँधा देने की होड़ में
# सैकड़ो के कुर्ते फटे थे,
# पुट्ठे छिले थे।
# भारत माता की जय,
# इंकलाब ज़िन्दाबाद,
# अंग्रेजी सरकार मुर्दाबाद
# के नारों में शहीद की माँ का रोदन
# डूब गया था।
# उसके आँसुओ की लड़ी
# फूल, खील, बताशों की झडी में
# छिप गई थी,
# जनता चिल्लाई थी-
# तेरा नाम सोने के अक्षरों में लिखा जाएगा।
# गली किसी गर्व से
# दिप गई थी।
# इसी घर से
# तीस बरस बाद
# शहीद की माँ का जनाजा निकला है,
# तिरंगे में लिपटा नहीं,
# केवल चार काँधों पर
# राम नाम सत्य है
# गोपाल नाम सत्य है
# के पुराने नारों पर;
# चर्चा है, बुढिया बे-सहारा थी,
# जीवन के कष्टों से मुक्त हुई,
# गली किसी राहत से
# छुई छुई।
# गर्म लोहा पीट, ठंडा पीटने को वक्त बहुतेरा पड़ा है।
# सख्त पंजा, नस कसी चौड़ी कलाई
# और बल्लेदार बाहें,
# और आँखें लाल चिंगारी सरीखी,
# चुस्त औ तीखी निगाहें,
# हाँथ में घन, और दो लोहे निहाई
# पर धरे तू देखता क्या?
# गर्म लोहा पीट, ठंडा पीटने को वक्त बहुतेरा पड़ा है।
# भीग उठता है पसीने से नहाता
# एक से जो जूझता है,
# ज़ोम में तुझको जवानी के न जाने
# खब्त क्या क्या सूझता है,
# या किसी नभ देवता नें ध्येय से कुछ
# फेर दी यों बुद्धि तेरी,
# कुछ बड़ा, तुझको बनाना है कि तेरा इम्तहां होता कड़ा है।
# गर्म लोहा पीट, ठंड़ा पीटने को वक्त बहुतेरा पड़ा है।
# एक गज छाती मगर सौ गज बराबर
# हौसला उसमें, सही है;
# कान करनी चाहिये जो कुछ
# तजुर्बेकार लोगों नें कही है;
# स्वप्न से लड़ स्वप्न की ही शक्ल में है
# लौह के टुकड़े बदलते
# लौह का वह ठोस बन कर है निकलता जो कि लोहे से लड़ा है।
# गर्म लोहा पीट, ठंड़ा पीटने को वक्त बहुतेरा पड़ा है।
# घन हथौड़े और तौले हाँथ की दे
# चोट, अब तलवार गढ तू
# और है किस चीज की तुझको भविष्यत
# माँग करता आज पढ तू,
# औ, अमित संतान को अपनी थमा जा
# धारवाली यह धरोहर
# वह अजित संसार में है शब्द का खर खड्ग ले कर जो खड़ा है।
# गर्म लोहा पीट, ठंडा पीटने को वक्त बहुतेरा पड़ा है।
# आज मुझसे बोल, बादल!
# तम भरा तू, तम भरा मैं,
# ग़म भरा तू, ग़म भरा मैं,
# आज तू अपने हृदय से हृदय मेरा तोल, बादल
# आज मुझसे बोल, बादल!
# आग तुझमें, आग मुझमें,
# राग तुझमें, राग मुझमें,
# आ मिलें हम आज अपने द्वार उर के खोल, बादल
# आज मुझसे बोल, बादल!
# भेद यह मत देख दो पल-
# क्षार जल मैं, तू मधुर जल,
# व्यर्थ मेरे अश्रु, तेरी बूंद है अनमोल, बादल
# आज मुझसे बोल, बादल!
# धूप बहुत है राहत इन्दौरी
#  धूप बहुत है मौसम जल थल भेजो ना
# धूप बहुत है मौसम जल थल भेजो न
# बाबा मेरे नाम का बादल भेजो न
# मौल्सरी की शाख़ों पर भी दिए जलें
# शाख़ों का केसरिया आँचल भेजो न
# नन्ही-मुन्नी सब चहकारें कहाँ गईं
# मोरों के पैरों की पायल भेजो न
# बस्ती-बस्ती दहशत किसने बो दी है
# गलियों-बाज़ारों की हलचल भेजो न
# सारे मौसम एक उमस के आदी हैं
# छाँव की ख़ुशबू, धूप का संदल भेजो न
# मैं बस्ती में आख़िर किस से बात करूँ
# मेरे जैसा कोई पागल भेजो न
#  सिर्फ़ सच और झूठ की मीज़ान में रक्खे रहे
# सिर्फ़ सच और झूठ की मीज़ान में रक्खे रहे
# हम बहादुर थे मगर मैदान में रक्खे रहे
# जुगनुओं ने फिर अँधेरों से लड़ाई जीत ली
# चाँद-सूरज घर के रौशनदान में रक्खे रहे
# धीरे-धीरे सारी किरनें ख़ुदकुशी करने लगीं
# हम सहीफ़ा थे मगर जुज़दान में रक्खे रहे
# बंद कमरे खोल कर सच्चाइयाँ रहने लगीं
# ख़्वाब कच्ची धूप थे, दालान में रक्खे रहे
# सिर्फ़ इतना फ़ासला है ज़िंदगी से मौत का
# शाख़ से तोड़े गए गुलदान में रक्खे रहे
# ज़िंदगी भर अपनी गूँगी धड़कनों के साथ-साथ
# हम भी घर के क़ीमती सामान में रक्खे रहे
#  सर पर सात आकाश ज़मीं पर सात समुंदर बिखरे हैं
# सर पर सात आकाश, ज़मीं पर सात समुंदर बिखरे हैं
# आँखें छोटी पड़ जाती हैं इतने मंज़र बिखरे हैं
# ज़िंदा रहना खेल नहीं है इस आबाद ख़राबे में
# वो भी अक्सर टूट गया है, हम भी अक्सर बिखरे हैं
# उस बस्ती के लोगों से जब बातें कीं तो ये जाना
# दुनिया भर को जोड़ने वाले अंदर-अंदर बिखरे हैं
# इन रातों से अपना रिश्ता जाने कैसा रिश्ता है
# नींदें कमरों में जागी हैं, ख़्वाब छतों पर बिखरे हैं
# आँगन के मासूम शजर ने एक कहानी लिक्खी है
# इतने फल शाख़ों पे नहीं थे जितने पत्थर बिखरे हैं
# सारी धरती, सारे मौसम, एक ही जैसे लगते हैं
# आँखों आँखों क़ैद हुए थे मंज़र मंज़र बिखरे हैं
#  हंसते रहते हैं मुसलसल हम-तुम
# हंसते रहते हैं मुसल्सल हम-तुम
# हों ना जायें कहीं पागल हम-तुम
# जैसे दरिया किसी दरिया से मिले
# आओ! हो जाएँ मुकम्मल हम-तुम
# उड़ती फिरती है हवाओं में ज़मीं
# रेंगते फिरते हैं पैदल हम-तुम
# प्यास सदियों की लिए आँखों में
# देखते रहते हैं बादल हम-तुम
# धूप हमने ही उगाई है यहां
# हैं इसी राह का पीपल हम-तुम
# शहर की हद ही नहीं आती है
# काटते रहते हैं जंगल हम-तुम
#  हौसले ज़िंदगी के देखते हैं
# हौसले ज़िंदगी के देखते हैं
# चलिए कुछ रोज़ जी के देखते हैं
# नींद पिछली सदी की ज़ख़्मी है
# ख़्वाब अगली सदी के देखते हैं
# रोज़ हम इस अँधेरी धुँध के पार
# क़ाफ़िले रौशनी के देखते हैं
# धूप इतनी कराहती क्यों है
# छाँव के ज़ख़्म सी के देखते हैं
# टुकटुकी बाँध ली है आँखों ने
# रास्ते वापसी के देखते हैं
# पानियों से तो प्यास बुझती नहीं
# आइए ज़हर पी के देखते हैं
#  हमें दिन-रात मरना चाहिए था
# हमें दिन-रात मरना चाहिए था
# मियाँ कुछ कर गुज़रना चाहिए था
# बहुत ही ख़ूबसूरत है ये दुनिया
# यहाँ कुछ दिन ठहरना चाहिए था
# मुझे तू ने किनारे से है जाना
# समंदर में उतरना चाहिए था
# यहाँ सदियों से तारीकी जमी है
# मेरी शब को सिहरना चाहिए था
# अकेली रात बिस्तर पर पड़ी है
# मुझे इस दिन से डरना चाहिए था
# डुबोकर मुझको ख़ुश होता है दरिया
# उसे तो डूब मरना चाहिए था
# किसी से बेवफ़ाई की है मैंने
# मुझे इक़रार करना चाहिए था
# ये देखो किरचियाँ हैं आइनों की
# सलीक़े से सँवरना चाहिए था
# किसी दिन उसकी महफ़िल में पहुँचकर
# गुलों में रंग भरना चाहिए था
# फ़लक पर तब्सरा करने से पहले
# ज़मीं का क़र्ज़ उतरना चाहिए था
#  दाव पर मैं भी, दाव पर तू भी है
# दाव पर मैं भी, दाव पर तू भी है
# बेख़बर मैं भी, बेख़बर तू भी
# आस्मां ! मुझसे दोस्ती करले
# दरबदर मैं भी, दरबदर तू भी
# कुछ दिनों शहर की हवा खा ले
# सीख जायेगा सब हुनर तू भी
# मैं तेरे साथ, तू किसी के साथ
# हमसफ़र मैं भी हमसफ़र तू भी
# हैं वफ़ाओं के दोनों दावेदार
# मैं भी इस पुलसिरात पर, तू भी
# ऐ मेरे दोसत ! तेरे बारे में
# कुछ अलग राय थी मगर, तू भी
#  कौन दरियाओं का हिसाब रखे
# कौन दरियाओं का हिसाब रखे
# नेकियाँ, नेकियों में डाल आया
# ज़िंदगी किस तरह गुज़ारते हैं
# ज़िंदगी भर न ये कमाल आया
# झूठ बोला है कोई आईना
# वर्ना पत्थर में कैसे बाल आया
# वो जो दो-गज़ ज़मीं थी मेरे नाम
# आसमाँ की तरफ़ उछाल आया
# क्यूँ ये सैलाब-सा है आँखों में
# मुस्कुराए थे हम, ख़याल आया
#  मेरे मरने की ख़बर है उसको
# मेरे मरने की ख़बर है उसको
# अपनी रुसवाई का डर है उसको
# अब वह पहला-सा नज़र आता नहीं
# ऐसा लगता है नज़र है उसको
# मैं किसी से भी मिलूँ, कुछ भी करूं
# मेरी नीयत की ख़बर है उसको
# भूल जाना उसे आसान नहीं
# याद रखना भी हुनर है उसको
# रोज़ मरने की दुआ माँगता है
# जाने किस बात का डर है उसको
# मंज़िलें साथ लिये फिरता है
# कितना दुश्वार सफ़र  है उसको
#  सर पर बोझ अँधियारों का है मौला ख़ैर
# सर पर बोझ अँधियारों का है मौला ख़ैर
# और सफ़र कुहसारों का है मौला ख़ैर
# दुश्मन से तो टक्कर ली है सौ-सौ बार
# सामना अबके यारों का है मौला ख़ैर
# इस दुनिया में तेरे बाद मेरे सर पर
# साया रिश्तेदारों का है मौला ख़ैर
# दुनिया से बाहर भी निकलकर देख चुके
# सब कुछ दुनियादारों का है मौला ख़ैर
# और क़यामत मेरे चराग़ों पर टूटी
# झगड़ा चाँद-सितारों का है मौला ख़ैर
# लिख रहा है हुजरा पीर फ़क़ीरों का
# और मंजर दरबारों का है मौला ख़ैर
# चौराहों पर वर्दी वाले आ  पहुंचे
# मौसम फिर त्यौहारों का है मौला ख़ैर
# एक ख़ुदा है, एक पयम्बर, एक किताब
# झगड़ा तो दस्तारों का है मौला ख़ैर
# वक़्त मिला तो मसजिद भी हो आएंगे
# बाक़ी काम मज़ारों का है मौला ख़ैर
# मैंने 'अलिफ़' से 'ये' तक ख़ुशबू बिखरा दी
# लेकिन गांव गंवारों का है मौला ख़ैर
#  हमें अब इश्क़ का चाला पड़ा है
# हमें अब इश्क़ का चाला पड़ा है
# बड़े मुँहज़ोर से पाला पड़ा है
# कई दिन से नहीं डूबा यह सूरज
# हथेली पर मेरी छाला पड़ा है
# यह साज़िश धूप की है या हवा की
# गुलों का रंग क्यों काला पड़ा है
# सफ़र पर मैं तो तनहा जा रहा हूं
# यह बस्ती भर में क्यों ताला पड़ा है
# मेरी पलकों पे उतरे फिर फ़रिश्ते
# समुन्दर फिर तह-ओ-बाला पड़ा है
# सुनहरा चांद उतरा है नदी में
# किनारे चांद का हाला पड़ा है
# यहां पर ख़त्म हैं ऊंची उड़ानें
# ज़मीं पर आसमां वाला पड़ा है
# उलझकर रह गए हैं सारे मंज़र
# हमारी आंख में जाला पड़ा है
# हवा है दोपहर तक भीगी-भीगी
# सवेरे देर तक पाला पड़ा है
#  पुराने शहर के मंज़र निकलने लगते हैं
# पुराने शहर के मंज़र निकलने लगते हैं
# ज़मीं जहाँ भी खुले घर निकलने लगते हैं
# मैं खोलता हूँ सदफ़ मोतियों के चक्कर में
# मगर यहाँ भी समन्दर निकलने लगते हैं
# हसीन लगते हैं जाड़ों में सुबह के मंज़र
# सितारे धूप पहन कर निकलने लगते हैं
# बुलन्दियों का तसव्वुर भी ख़ूब होता है
# कभी-कभी तो मेरे पर निकलने लगते हैं
# बुरे दिनों से बचाना मुझे मेरे मौला !
# क़रीबी दोस्त भी बच कर निकलने लगते हैं
# अगर ख़्याल भी आए कि तुझको ख़त लिक्खूँ
# तो घोंसलों से कबूतर निकलने लगते हैं
#  अपने दीवार-ओ-दर से पूछते हैं
# अपने दीवार-ओ-दर से पूछते हैं
# घर के हालात घर से पूछते हैं
# क्यूँ अकेले हैं क़ाफ़िले वाले
# एक-एक हमसफ़र से पूछते हैं
# कितने जंगल हैं इन मकानों में
# बस यही शहर भर से पूछते हैं
# यह जो दीवार है यह किस की है
# हम इधर वह उधर से पूछते हैं
# हैं कनीज़ें भी इस महल में क्या
# शाहज़ादों के डर से पूछते हैं
# क्या कहीं क़त्ल हो गया सूरज
# रात से रात-भर से पूछते हैं
# जुर्म है ख़्वाब देखना भी क्या
# रात-भर चश्म-ए-तर से पूछते हैं
# ये मुलाक़ात आख़िरी तो नहीं
# हम जुदाई के डर से पूछते हैं
# कौन वारिस है छाँव का आख़िर
# धूप में हम-सफ़र से पूछते हैं
# ये किनारे भी कितने सादा हैं
# कश्तियों को भँवर से पूछते हैं
# वो गुज़रता तो होगा अब तन्हा
# एक-इक रहगुज़र से पूछते हैं
# क्या कभी ज़िंदगी भी देखेंगे
# बस यही उम्र-भर से पूछते हैं
# ज़ख़्म का नाम फूल कैसे पड़ा
# तेरे दस्त-ए-हुनर से पूछते हैं
#  हमने ख़ुद अपनी रहनुमाई की
# हमने ख़ुद अपनी रहनुमाई की
# और शोहरत हुई ख़ुदाई की
# मैंने दुनिया से, मुझ से दुनिया ने
# सैकड़ों बार बेवफ़ाई की
# खुले रहते हैं सारे दरवाज़े
# कोई सूरत नहीं रिहाई की
# टूटकर हम मिले हैं पहली बार
# ये शुरूआ'त है जुदाई की
# सोए रहते हैं ओढ़ कर ख़ुद को
# अब ज़रूरत नहीं रज़ाई की
# मंज़िलें चूमती हैं मेरे क़दम
# दाद दीजे शिकस्ता-पाई की
# ज़िंदगी जैसे-तैसे काटनी है
# क्या भलाई की, क्या बुराई की
# इश्क़ के कारोबार में हमने
# जान दे कर बड़ी कमाई की
# अब किसी की ज़बाँ नहीं खुलती
# रस्म जारी है मुँह-भराई की
#  शजर हैं अब समर आसार मेरे
# शजर हैं अब समर आसार मेरे
# उगे आते हैं दावेदार मेरे
# मुहाजिर हैं न अब अंसार मेरे
# मुख़ालिफ़ हैं बहुत इस बार मेरे
# यहाँ इक बूँद का मुहताज हूँ मैं
# समुंदर हैं समुंदर पार मेरे
# अभी मुर्दों में रूहें फूँक डालें
# अगर चाहें तो ये बीमार मेरे
# हवाएँ ओढ़ कर सोया था दुश्मन
# गए बेकार सारे वार मेरे
# मैं आ कर दुश्मनों में बस गया हूँ
# यहाँ हमदर्द हैं दो-चार मेरे
# हँसी में टाल देना था मुझे भी
# ख़ता क्यूँ हो गए सरकार मेरे
# तसव्वुर में न जाने कौन आया
# महक उट्ठे दर-ओ-दीवार मेरे
# तुम्हारा नाम दुनिया जानती है
# बहुत रुस्वा हैं अब अशआर मेरे
# भँवर में रुक गई है नाव मेरी
# किनारे रह गए इस पार मेरे
# मैं ख़ुद अपनी हिफ़ाज़त कर रहा हूँ
# अभी सोए हैं पहरे-दार मेरे
#  इधर की शय उधर कर दी गई है
# इधर की शय उधर कर दी गई है
# ज़मीं ज़ेरो-ज़बर कर दी गई है
# ये काली रात है दो चार पल की
# ये कहने में सहर कर दी गई है
# तआरुफ़ को ज़रा फैला दिया है
# कहानी मुख्तसर कर दी गई है
# इबादत में बसर करनी थी लेकिन
# ख़राबों में बसर कर दी गई है
# कई ज़र्रात बाग़ी हो चुके हैं
# सितारों को ख़बर कर दी गई है
# वह मेरी हम-क़दम होने न पाई
# जो मेरी हम-सफ़र कर दी गई है
#  पाँव से आसमान लिपटा है
# पाँव से आसमान लिपटा है
# रास्तों से मकान लिपटा है
# रौशनी है तेरे ख़यालों की
# मुझसे रेशम का थान लिपटा है
# कर गये सब किनारा कश्ती से
# सिर्फ़ इक बादवन लिपटा है
# दे तवानाईयां मेरे माबूद !
# जिस्म से ख़ानदान लिपटा है
# और मैं सुन रहा हूँ क्या-क्या कुछ
# मुझसे एक बेजुबान लिपटा है
# सारी दुनिया बुला रही है मगर
# मुझसे हिन्दोस्तान लिपटा है
#  सफ़र में जब भी इरादे जवान मिलते हैं
# सफ़र में जब भी इरादे जवान मिलते हैं
# खुली हवाएँ, खुले बादबान मिलते हैं
# बहुत कठिन है मसाफ़त नई ज़मीनों की
# क़दम-क़दम पे नये आसमान मिलते हैं
# मैं उस मुहल्ले में एक उम्र काट आया हूँ
# जहाँ पे घर नहीं मिलते, मकान मिलते हैं
# बात आपस में जो ज़ोर-ज़ोर से करते हैं
# सफ़र में ऐसे कई बेज़बान मिलते हैं
# जहाँ-जहाँ भी चिराग़ों ने ख़ुदकुशी की है
# वहाँ-वहाँ पे हवा के निशान मिलते हैं
# रक़ीब, दोस्त, पड़ोसी, अज़ीज़, रिश्तेदार
# मेरे ख़िलाफ़  सभी के बयान मिलते हैं
#  ऊँचे-ऊँचे दरबारों से क्या लेना
# ऊँचे-ऊँचे दरबारों से क्या लेना
# बेचारे हैं, बेचारों से क्या लेना
# जो मांगेंगे तूफ़ानों से मांगेंगे
# काग़ज़ की इन पतवारों से क्या लेना
# हम ठहरे बंजारे हम बंजारों को
# दरवाज़ों और दीवारों से क्या लेना
# ख़्वाबों वाली कोई चीज़ नहीं मिलती
# सोच रहा हूँ बाज़ारों से क्या लेना
# ख़ाली हाथों जीतना है ये जंग हमें
# लकड़ी की इन तलवारों से क्या लेना
# आग में हम तो बाग़ लगाते हैं हमको
# दोज़ख़ ! तेरे अंगारों से क्या लेना
# चारागरी का दावा करते फिरते हैं
# बस्ती के इन बीमारों से क्या लेना
# साथ हमारे कई सुनहरी सदियाँ हैं
# हमें शनीचर, इतवारों से क्या लेना
# अपना मालिक अपना ख़ालिक़ अफ़ज़ल है
# आती-जाती सरकारों से क्या लेना
# पाँव पसारो सारी धरती अपनी है
# यार ! इजाज़त मक्कारों से क्या लेना
#  काम सब ग़ैर-ज़रूरी हैं जो सब करते हैं
# काम सब ग़ैर-ज़रूरी हैं जो सब करते हैं
# और हम कुछ नहीं करते हैं ग़ज़ब करते हैं
# आप की नज़रों में सूरज की है जितनी अज़्मत
# हम चराग़ों का भी उतना ही अदब करते हैं
# हम पे हाकिम का कोई हुक्म नहीं चलता है
# हम क़लंदर हैं शहंशाह लक़ब करते हैं
# देखिए जिस को उसे धुन है मसीहाई की
# आज कल शहर के बीमार मतब करते हैं
# ख़ुद को पत्थर सा बना रक्खा है कुछ लोगों ने
# बोल सकते हैं मगर बात ही कब करते हैं
# एक इक पल को किताबों की तरह पढ़ने लगे
# उम्र भर जो न किया हम ने वो अब करते हैं
#  किसने दस्तक दी है दिल पर कौन है
# किसने दस्तक दी है दिल पर कौन है
# आप तो अन्दर हैं बाहर कौन है
# रौशनी ही रौशनी है हर तरफ़
# मेरी आँखों में मुन्नवर कौन है
# आसमां झुक-झुक के करता है सवाल
# आपके कद के बराबर कौन है
# हम रखेंगें अपने अश्कों का हिसाब
# पूछने वाला समंदर कौन है
# सारी दुनिया हैरती है किसलिए
# दूर तक मंज़र ब मंज़र कौन है
#  शराब छोड़ दी तुमने कमाल है ठाकुर
# शराब छोड़ दी तुमने कमाल है ठाकुर
# मगर ये हाथ में क्या लाल लाल है ठाकुर
# कई मलूल से चेहरे तुम्हारे गाँव में हैं सुना है
# तुम को भी इस का मलाल है ठाकुर
# ख़राब हालों का जो हाल था ज़माने से
# तुम्हारे फैज़ से अब भी बहाल है ठाकुर
# इधर तुहारे ख़ज़ाने जवाब देते हैं
# उधर हमारी अना का सवाल है ठाकुर
# किसी गरीब दुपट्टे का कर्ज़ है इस पर
# तुम्हारे पास जो रेशम की शाल है ठाकुर
# तुम्हारी लाल हवेली छुपा न पाएगी
# हमे ख़बर है कहाँ कितना माल है ठाकुर
# दुआ को नन्हे गुलाबों ने हाथ उठाये हैं
# बस अब यहाँ से तुम्हारा जवाल है ठाकुर
#  मोहब्बतों के सफ़र पर निकल के देखूँगा
# मोहब्बतों के सफ़र पर निकल के देखूँगा
# ये पुल-सिरात अगर है तो चल के देखूँगा
# सवाल ये है कि रफ़्तार किस की कितनी है
# मैं आफ़्ताब से आगे निकल के देखूँगा
# मज़ाक़ अच्छा रहेगा ये चाँद-तारों से
# मैं आज शाम से पहले ही ढल के देखूँगा
# वो मेरे हुक्म को फ़रियाद जान लेता है
# अगर ये सच है तो लहजा बदल के देखूँगा
# उजाले बाँटने वालों पे क्या गुज़रती है
# किसी चराग़ की मानिंद जल के देखूँगा
# अजब नहीं कि वही रौशनी मुझे मिल जाए
# मैं अपने घर से किसी दिन निकल के देखूँगा
#  जितना देख आये हैं अच्छा है यही काफ़ी है
# जितना देख आये हैं अच्छा है यही काफ़ी है
# अब कहाँ जाइयेगा दुनिया है यही काफ़ी है
# हमसे नाराज़ है एक सूरज कि पड़े सोते हो
# जाग उठने की तमन्ना है बस यही काफ़ी है
# अब ज़रूरी तो नहीं है कि वह फलदार भी हो
# शाख से पेड़ का रिश्ता है यही काफ़ी है
# लाओ मैं तुमको समुन्दर के इलाके लिख दूं
# मेरे हिस्से में ये क़तरा है यही काफ़ी है
# अब अगर कम भी जियें हम तो कोई रंज नहीं
# हमको जीने का सलीक़ा है यही काफ़ी है
# क्या ज़रूरी है कभी तुम से मुलाक़ात भी हो
# तुमसे मिलने की तमन्ना है यही काफ़ी है
# अब सितारों पे कहां जायें तनाबें लेकर,
# ये जो मिट्‌टी का घरौंदा है यही काफ़ी है।
#  सब को रुस्वा बारी बारी किया करो
# सब को रुस्वा बारी बारी किया करो
# हर मौसम में फ़तवे जारी किया करो
# रातों का नींदों से रिश्ता टूट चुका
# अपने घर की पहरे-दारी किया करो
# क़तरा क़तरा शबनम गिन कर क्या होगा
# दरियाओं की दावे-दारी किया करो
# रोज़ क़सीदे लिक्खो गूँगे बहरों के
# फ़ुर्सत हो तो ये बेगारी किया करो
# शब भर आने वाले दिन के ख़्वाब बुनो
# दिन भर फ़िक्र-ए-शब-बेदारी किया करो
# चाँद ज़ियादा रौशन है तो रहने दो
# जुगनू-भय्या जी मत भारी किया करो
# जब जी चाहे मौत बिछा दो बस्ती में
# लेकिन बातें प्यारी प्यारी किया करो
# रात बदन-दरिया में रोज़ उतरती है
# इस कश्ती में ख़ूब सवारी किया करो
# रोज़ वही इक कोशिश ज़िंदा रहने की
# मरने की भी कुछ तय्यारी किया करो
# ख़्वाब लपेटे सोते रहना ठीक नहीं
# फ़ुर्सत हो तो शब-बेदारी किया करो
# काग़ज़ को सब सौंप दिया ये ठीक नहीं
# शेर कभी ख़ुद पर भी तारी किया करो
#  मौत की तफ़सील होनी चाहिये
# मौत की तफ़सील होनी चाहिये
# शहर में एक झील होनी चाहिये
# चाँद तो हर शब निकलता है मगर
# ताक़ में क़न्दील होनी चाहिये
# रौशनी जो जिस्म तक महदूद है
# रूह में तहलील होनी चाहिये
# हुक्म गूंगों का है लेकिन हुक्म है
# हुक्म की तामील होनी चाहिये
#  दिये जलाये तो अंजाम क्या हुआ मेरा
# दिये जलाये तो अंजाम क्या हुआ मेरा
# लिखा है तेज हवाओं ने मर्सिया मेरा
# कहीं शरीफ नमाज़ी कहीं फ़रेबी पीर
# कबीला मेरा नसब मेरा सिलसिला मेरा
# किसी ने जहर कहा है किसी ने शहद कहा
# कोई समझ नहीं पाता है जायका मेरा
# मैं चाहता था ग़ज़ल आस्मान हो जाये
# मगर ज़मीन से चिपका है काफ़िया मेरा
# मैं पत्थरों की तरह गूंगे सामईन में था
# मुझे सुनाते रहे लोग वाकिया मेरा
# उसे खबर है कि मैं हर्फ़-हर्फ़ सूरज हूँ
# वो शख्स पढ़ता रहा है लिखा हुआ मेरा
# जहाँ पे कुछ भी नहीं है वहाँ बहुत कुछ है
# ये कायनात तो है खाली हाशिया मेरा
# बुलंदियों के सफर में ये ध्यान आता है
# ज़मीन देख रही होगी रास्ता मेरा
# मैं जंग जीत चुका हूँ मगर ये उलझन है
# अब अपने आप से होगा मुक़ाबला मेरा
# खिंचा-खिंचा मैं रहा ख़ुद से जाने क्यों वरना
# बहुत ज्यादा न था मुझसे फ़ासला मेरा
#  सिर्फ़ ख़ंजर ही नहीं आँखों में पानी चाहिए
# सिर्फ़ ख़ंजर ही नहीं आँखों में पानी चाहिए
# ऐ ख़ुदा दुश्मन भी मुझ को ख़ानदानी चाहिए
# शहर की सारी अलिफ़-लैलाएँ बूढ़ी हो चुकीं
# शाहज़ादे को कोई ताज़ा कहानी चाहिए
# मैं ने ऐ सूरज तुझे पूजा नहीं समझा तो है
# मेरे हिस्से में भी थोड़ी धूप आनी चाहिए
# मेरी क़ीमत कौन दे सकता है इस बाज़ार में
# तुम ज़ुलेख़ा हो तुम्हें क़ीमत लगानी चाहिए
# ज़िंदगी है इक सफ़र और ज़िंदगी की राह में
# ज़िंदगी भी आए तो ठोकर लगानी चाहिए
# मैं ने अपनी ख़ुश्क आँखों से लहू छलका दिया
# इक समुंदर कह रहा था मुझ को पानी चाहिए
#  धर्म बूढ़े हो गए मज़हब पुराने हो गए
# धर्म बूढ़े हो गए मज़हब पुराने हो गए
# ऐ तमाशागार तेरे करतब पुराने हो गए
# कैसी चाहत क्या मुरव्वत क्या मुहब्बत क्या ख़ुलूस
# इन सभी अल्फ़ाज़ के मतलब पुराने हो गए
# आज-कल छुट्टी के दिन भी घर पड़े रहते हैं हम
# शाम, साहिल ,तुम, समंदर सब पुराने हो गए
# रेंगते रहते हैं हम सदियों से सदियाँ ओढ़कर
# हम नए थे ही कहाँ जो अब पुराने हो गए
# आस्तीनों में वही खंजर वही हमदर्दियाँ
# है नए अहबाब लेकिन ढब पुराने हो गए
# एक ही मरकज़ पे आँखें जंग-आलूदा हुईं
# चाक पर फिर-फिर के रोज़ो-शब पुराने हो गए
#  मेरी तेज़ी, मेरी रफ़्तार हो जा
# मेरी तेज़ी, मेरी रफ़्तार हो जा
# सुबक रौ, उठ कभी तलवार हो जा
# अभी सूरज सदा देकर गया है
# ख़ुदा के वास्ते बेदार हो जा
# है फ़ुर्सत तो किसी से इश्क कर ले
# हमारी ही तरह बेकार हो जा
# तेरी दुश्मन है तेरी सादालौही
# मेरी माने तो तू कुछ दुशवार हो जा
# शिकस्ता कश्तियों से क्या उम्मीदें
# किनारे सो रहे हैं, पार हो जा
# तुझे कया दर्द की लज़्ज़त बताएँ
# मसीहा ! आ कभी बीमार हो जा
#  उसे अब के वफ़ाओं से गुज़र जाने की जल्दी थी
# उसे अब के वफ़ाओं से गुज़र जाने की जल्दी थी
# मगर इस बार मुझ को अपने घर जाने की जल्दी थी
# इरादा था कि मैं कुछ देर तूफ़ाँ का मज़ा लेता
# मगर बेचारे दरिया को उतर जाने की जल्दी थी
# मैं अपनी मुट्ठियों में क़ैद कर लेता ज़मीनों को
# मगर मेरे क़बीले को बिखर जाने की जल्दी थी
# मैं आख़िर कौन सा मौसम तुम्हारे नाम कर देता
# यहाँ हर एक मौसम को गुज़र जाने की जल्दी थी
# वह शाख़ों से जुदा होते हुए पत्तों पे हँसते थे
# बड़े ज़िंदा-नज़र थे जिन को मर जाने की जल्दी थी
# मैं साबित किस तरह करता कि हर आईना झूटा है
# कई कम-ज़र्फ़ चेहरों को उतर जाने की जल्दी थी
#  तेरे वादे की तेरे प्यार की मोहताज नहीं
# तेरे वादे की तेरे प्यार की मोहताज नहीं
# ये कहानी किसी किरदार की मोहताज नहीं
# आसमां ओढ़ के सोए हैं खुले मैदां में
# अपनी ये छत किसी दीवार की मोहताज नहीं
# ख़ाली कशकौल पे इतराई हुई फिरती है
# ये फ़क़ीरी किसी दस्तार की मोहताज नहीं
# ख़ुद कफ़ीली का हुनर सीख लिया है मैंने
# ज़िन्दगी अब किसी सरकार की मोहताज नहीं
# मेरी तहरीर है चस्पां मेरी पेशानी पर
# अब जुबां ज़िल्लत-ए-इज़हार की मोहताज नहीं
# लोग होंठों पे सजाए हुए फिरते हैं मुझे
# मेरी शोहरत किसी अख़बार की मोहताज नहीं
# रोज़ आबाद नये शहर किया करती है
# शायरी अब किसी दरबार की मोहताज नहीं
# मेरे अख़लाक़ की एक धूम है बाज़ारों में
# ये वह शय है जो ख़रीदार की मोहताज नहीं
# इसे तूफ़ां ही किनारे से लगा देते हैं
# मेरी कश्ती किसी पतवार की मोहताज नहीं
# मैंने मुल्कों की तरह लोगों के दिल जीते हैं
# ये हुकूमत किसी तलवार की मोहताज नहीं
#  ऊँघती रहगुज़र के बारे में
# ऊँघती रहगुज़र के बारे में
# लोग पूछेंगे घर के बारे में
# मील के पत्थरों से पूछता हूँ
# अपने एक हमसफ़र के बारे में
# मश्वरा कर रहे हैं आपस में
# चन्द जुगनू सहर के बारे में
# एक सच्ची ख़बर सुनानी है
# एक झूठी ख़बर के बारे में
# उंगलियों से लहु टपकता है
# क्या लिखें चारागर के बारे में
# लाख वह गुमशुदा सही लेकिन
# जानता है ख़िज़र के बारे में
#  दरबदर जो थे वह दीवारों के मालिक हो गये
# दरबदर जो थे वह दीवारों के मालिक हो गये
# मेरे सब दरबान, दरबारों के मालिक हो गये
# लफ़्ज़ गूँगे हो चुके, तहरीर अंधी हो चुकी
# जितने मुख़बिर थे वे अख़बारों के मालिक हो गये
# लाल सूरज आसमां से घर की छत पर आ गया
# जितने थे बेकार सब कारों के मालिक हो गये
# और अपने घर में हम बैठे रहे मशअल बकफ़
# चन्द जुगनू चांद और तारों के मालिक हो गये
# देखते ही देखते कितनी दुकानें खुल गईं
# बिकने आए थे वह बाज़ारों के मालिक हो गये
# सर बकफ़ थे तो सरों से हाथ धोना पड़ गया
# सर झुकाए थे वह दस्तारों के मालिक हो गये
#  दो गज़ टुकड़ा उजले-उजले बादल का
# दो गज़ टुकड़ा उजले-उजले बादल का
# याद आता है एक दुपट्टा मलमल का
# शहर के मंज़र देख के चीख़ा करता है
# मेरे अन्दर इक सन्नाटा जंगल का
# बादल हाथी-घोड़े ले कर आते हैं
# लेकिन अपना रस्ता तो है पैदल का
# मुझसे आकर मेरी जुबां में बात करे
# लिखता रहता है जो खाता हर पल का
# आते-जाते अंधी आँखें पढ़ती हैं
# हर पत्थर पर नाम लिखा है मख़मल का
# खुले-खुले से रहने के हम आदी हैं
# ध्यान किसे है दरवाज़े की साँक़ल का
# देखें किस दिन पहुँचोगे तुम तारों तक
# ऊँचाई तक इक रस्ता है दलदल का
# गीला दामन गीली-गीली आँखें हैं
# हर मौसम में एक मौसम है जल-थल का
# मुझको अपने रंग में ढाला दुनिया ने
# साँप हुआ हूँ ख़ुद ही अपने सन्दल का
# देखें कितना बाज़ारों में आए उछाल
# हम सोना हैं और ज़माना पीतल का
#  दुआओं में वह तुम्हें याद करने वाला है
# दुआओं में वह तुम्हें याद करने वाला है
# कोई फ़क़ीर की इमदाद करने वाला है
# ये सोच-सोच के शर्मिन्दगी-सी होती है
# वह हुक्म देगा जो फ़रियाद करने वाला है
# ज़मीन ! हम भी तेरे वारिसों में हैं कि नहीं
# वह इस सवाल को बुनियाद करने वाला है
# यही ज़मीन मुझे गोद लेने वाली है
# ये आसमां मेरी इमदाद करने वाला है
# ये वक़्त तू जिसे बरबाद करता रहता है
# ये वक़्त ही तुझे बरबाद करने वाला है
# ख़ुदा दराज़ करे उम्र मेरे दुश्मन की
# कोई तो है जो मुझे याद करने वाला है
#  सबब वह पूछ रहे हैं उदास होने का
# सबब वह पूछ रहे हैं उदास होने का
# मिरा मिज़ाज नहीं बेलिबास होने का
# नया बहाना है हर पल उदास होने का
# ये फ़ायदा है तिरे घर के पास होने का
# महकती रात के लम्हो ! नज़र रखो मुझ पर
# बहाना ढूँढ़ रहा हूँ उदास होने का
# मैं तेरे पास बता किस ग़रज़ से आया हूँ
# सुबूत दे मुझे चेहरा-शनास होने का
# मिरी ग़ज़ल से बना ज़ेहन में कोई तस्वीर
# सबब न पूछ मिरे देवदास होने का
# कहाँ हो आओ मिरी भूली-बिसरी यादो आओ
# ख़ुश-आमदीद है मौसम उदास होने का
# कई दिनों से तबीअ'त मिरी उदास न थी
# यही जवाज़ बहुत है उदास होने का
# मैं अहमियत भी समझता हूँ क़हक़हों की मगर
# मज़ा कुछ अपना अलग है उदास होने का
# मिरे लबों से तबस्सुम मज़ाक़ करने लगा
# मैं लिख रहा था क़सीदा उदास होने का
# पता नहीं ये परिंदे कहाँ से आ पहुँचे
# अभी ज़माना कहाँ था उदास होने का
# मैं कह रहा हूँ कि ऐ दिल इधर-उधर न भटक
# गुज़र न जाए ज़माना उदास होने का
#  अँधेरे चारों तरफ़ सांय-सांय करने लगे
# अँधेरे चारों तरफ़ सांय-सांय करने लगे
# चिराग़ हाथ उठाकर दुआएँ करने लगे
# तरक़्क़ी कर गए बीमारियों के सौदागर
# ये सब मरीज़ हैं जो अब दवाएँ करने लगे
# लहूलोहान पड़ा था ज़मीं पे इक सूरज
# परिन्दे अपने परों से हवाएँ करने लगे
# ज़मीं पे आ गए आँखों से टूट कर आँसू
# बुरी ख़बर है फ़रिश्ते ख़ताएँ करने लगे
# झुलस रहे हैं यहाँ छाँव बाँटने वाले
# वो धूप है कि शजर इलतिजाएँ करने लगे
# अजीब रंग था मजलिस का, ख़ूब महफ़िल थी
# सफ़ेद पोश उठे कांय-कांय करने लगे
#  अगर ख़िलाफ़ हैं होने दो जान थोड़ी है
# अगर ख़िलाफ़ हैं होने दो जान थोड़ी है
# ये सब धुआँ है कोई आसमान थोड़ी है
# लगेगी आग तो आएँगे घर कई ज़द में
# यहाँ पे सिर्फ़ हमारा मकान थोड़ी है
# मैं जानता हूँ कि दुश्मन भी कम नहीं लेकिन
# हमारी तरह हथेली पे जान थोड़ी है
# हमारे मुँह से जो निकले वही सदाक़त है
# हमारे मुँह में तुम्हारी ज़ुबान थोड़ी है
# सभी का ख़ून है शामिल यहाँ की मिट्टी में
# किसी के बाप का हिन्दोस्तान थोड़ी है
# जो आज साहिबे मसनद हैं कल नहीं होंगे
# किराएदार हैं ज़ाती मकान थोड़ी है
#  रात की धड़कन जब तक जारी रहती है
# रात की धड़कन जब तक जारी रहती है
# सोते नहीं हम ज़िम्मेदारी रहती है
# जब से तू ने हल्की हल्की बातें कीं
# यार तबीअत भारी भारी रहती है
# पाँव कमर तक धँस जाते हैं धरती में
# हाथ पसारे जब ख़ुद्दारी रहती है
# वो मंज़िल पर अक्सर देर से पहुँचे हैं
# जिन लोगों के पास सवारी रहती है
# छत से उस की धूप के नेज़े आते हैं
# जब आँगन में छाँव हमारी रहती है
# घर के बाहर ढूँढता रहता हूँ दुनिया
# घर के अंदर दुनिया-दारी रहती है
#  बैर दुनिया से क़बीले से लड़ाई लेते
# बैर दुनिया से क़बीले से लड़ाई लेते
# एक सच के लिए किस-किस से बुराई लेते
# आबले अपने ही अँगारों के ताज़ा हैं अभी
# लोग क्यूँ आग हथेली पे पराई लेते
# बर्फ़ की तरह दिसम्बर का सफ़र होता है
# हम उसे साथ न लेते तो रज़ाई लेते
# कितना मानूस-सा हमदर्दों का ये दर्द रहा
# इश्क़ कुछ रोग नहीं था जो दवाई लेते
# चाँद रातों में हमें डसता है दिन में सूरज
# शर्म आती है अंधेरों से कमाई लेते
# तुम ने जो तोड़ दिए ख़्वाब हम उन के बदले
# कोई क़ीमत कभी लेते तो ख़ुदाई लेते
#  तो क्या बारिश भी ज़हरीली हुई है
# तो क्या बारिश भी ज़हरीली हुई है
# हमारी फ़स्ल क्यों नीली हुई है
# ये किसने बाल खोले मौसमों के
# हवा क्यों इतनी बर्फ़ीली हुई है
# किसी दिन पूछिये सूरजमुखी से
# कि रंगत किसलिये पीली हुई है
# सफ़र का लुत्फ़ बढ़ता जा रहा है
# ज़मीं कुछ और पथरीली हुई है
# सुनहरी लग रहा है एक-एक पल
# कई सदियों में तबदीली हुई है
# दिखाया है अगर सूरज ने गुस्सा
# तो बालू और चमकीली हुई है
#  चराग़ों को उछाला जा रहा है
# चराग़ों को उछाला जा रहा है
# हवा पर रोब डाला जा रहा है
# न हार अपनी न अपनी जीत होगी
# मगर सिक्का उछाला जा रहा है
# वो देखो मय-कदे के रास्ते में
# कोई अल्लाह-वाला जा रहा है
# थे पहले ही कई साँप आस्तीं में
# अब इक बिच्छू भी पाला जा रहा है
# मिरे झूटे गिलासों की छका कर
# बहकतों को सँभाला जा रहा है
# हमी बुनियाद का पत्थर हैं लेकिन
# हमें घर से निकाला जा रहा है
# जनाज़े पर मिरे लिख देना यारो
# मोहब्बत करने वाला जा रहा है
#  ये सर्द रातें भी बन कर अभी धुआँ उड़ जाएँ
# ये सर्द रातें भी बन कर अभी धुआँ उड़ जाएँ
# वह इक लिहाफ़ मैं ओढूँ तो सर्दियाँ उड़ जाएँ
# ख़ुदा का शुक्र कि मेरा मकाँ सलामत है
# हैं इतनी तेज़ हवाएँ कि बस्तियाँ उड़ जाएँ
# ज़मीं से एक तअल्लुक़ ने बाँध रक्खा है
# बदन में ख़ून नहीं हो तो हड्डियाँ उड़ जाएँ
# बिखर-बिखर सी गई है किताब साँसों की
# ये काग़ज़ात ख़ुदा जाने कब कहाँ उड़ जाएँ
# रहे ख़याल कि मज्ज़ूब-ए-इश्क़ हैं हम लोग
# अगर ज़मीन से फूंकें तो आसमाँ उड़ जाएँ
# हवाएँ बाज़ कहाँ आती हैं शरारत से
# सरों पे हाथ न रक्खें तो पगड़ियाँ उड़ जाएँ
# बहुत ग़ुरूर है दरिया को अपने होने पर
# जो मेरी प्यास से उलझे तो धज्जियाँ उड़ जाएँ
#  खुश्क दरियाओं में हल्की सी रवानी और है
# खुश्क दरियाओं में हल्की सी रवानी और है
# रेत के नीचे अभी थोड़ा सा पानी और है
# इक कहानी खत्म करके वो बहुत है मुतमईन
# भूल बैठा है कि आगे इक कहानी और है
# जो भी मिलता है उसे अपना समझ लेता हूँ मैं
# एक बीमारी मुझे ये खानदानी और है
# बोरिये पर बैठिए, कुल्हड़ में पानी पीजिए
# हम कलन्दर हैं हमारी मेजबानी और है
# एक दिन इस शहर की कीमत लगाईं जायेगी
# गाँव में थोड़ी बहुत खेती-किसानी और है
# कौन फिर पूछेगा गूंगे मुंसिफ़ों से खैरियत
# एक ले-देकर हमारी बे-ज़बानी और है
#  हर मुसाफ़िर है सहारे तेरे
# हर मुसाफ़िर है सहारे तेरे
# कश्तियां तेरी, किनारे तेरे
# तेरे दामन को ख़बर दे कोई,
# टूटते रहते हैं तारे तेरे
# धूप दरिया में रवानी थी बहुत
# बह थक गए चांद सितारे तेरे
# तेरे दरवाज़े को जुम्बिश न हुई
# मैंने सब नाम पुकारे तेरे
# बे तलब आँखों में क्या-क्या कुछ है
# वो समझता है इशारे तेरे
# कब पसीजेंगे ये बहरे बादल
# हैं शज़र हाथ पसारे तेरे
# मेरा इक पल भी मुझे मिल न सका
# मैंने दिन-रात गुज़ारे तेरे
# तेरी आँखें तेरी बीनाई है
# तेरे मंज़र हैं नज़ारे  तेरे
# यह मेरी प्यास बता सकती है
# क्यों समंदर हुए खारे तेरे
# जो भी मनसूब तेरे नाम से थे
# मैंने सब क़र्ज़ उतारे तेरे
# तूने लिखा मेरे चेहरे पे धुंआ
# मैंने आईने संवारे तेरे
# और मेरा दिल वही मुफ़लिस का चिराग़
# चाँद तेरा है सितारे तेरे
#  ये हर सू जो फ़लक-मंज़र खड़े हैं
# ये हर सू जो फ़लक-मंज़र खड़े हैं
# न जाने किसके पैरों पर खड़े हैं
# तुला है धूप बरसाने पे सूरज
# शजर भी छतरियाँ लेकर खड़े हैं
# उन्हें नामों से मैं पहचानता हूँ
# मेरे दुश्मन मेरे अन्दर खड़े हैं
# किसी दिन चाँद निकला था यहाँ से
# उजाले आज भी छत पर खड़े हैं
# जुलूस आने को है दीदावरों का
# नजर नीची किये मंजर खड़े हैं
# उजाला-सा है कुछ कमरे के अन्दर
# ज़मीनो-आस्माँ बाहर खड़े हैं
#  अब अपनी रूह के छालों का कुछ हिसाब करूँ
# अब अपनी रूह के छालों का कुछ हिसाब करूँ
# मैं चाहता था चिराग़ों को आफ़्ताब करूँ
# बुतों से मुझको इजाज़त अगर कभी मिल जाए
# तो शहर-भर के ख़ुदाओं को बे-नक़ाब करूँ
# मैं करवटों के नए ज़ाविये लिखूँ शब-भर
# ये इश्क़ है तो कहाँ ज़िंदगी अज़ाब करूँ
# है मेरे चारों तरफ़ भीड़ गूँगे-बहरों की
# किसे ख़तीब बनाऊँ किसे ख़िताब करूँ
# उस आदमी को बस इक धुन सवार रहती है
# बहुत हसीं है ये दुनिया इसे ख़राब करूँ
# ये ज़िंदगी जो मुझे क़र्ज़दार करती रही
# कहीं अकेले में मिल जाए तो हिसाब करूँ
#  ज़िन्दगी उम्र से बड़ी तो नहीं
# ज़िन्दगी उम्र से बड़ी तो नहीं
# ये कहीं मौत की घड़ी तो नहीं
# ये अलग बात हम भटक जाएँ
# वैसे दुनिया बहुत बड़ी तो नहीं
# टूट सकता है ये तअल्लुक़ भी
# इश्क है कोई हथकड़ी तो नहीं
# आते-आते ही आयेगी मंज़िल
# रास्ते में कहीं पड़ी तो नहीं
# एक खटका-खा है बिछड़ने का
# ये मुलाक़ात की घड़ी तो नहीं
# एक जंगल है दूर-दूर तलक
# ये मेरे शहर की कड़ी तो नहीं
#  हाथ ख़ाली हैं तिरे शहर से जाते जाते
# हाथ ख़ाली हैं तिरे शहर से जाते जाते
# जान होती तो मिरी जान लुटाते जाते
# अब तो हर हाथ का पत्थर हमें पहचानता है
# उम्र गुज़री है तिरे शहर में आते जाते
# रेंगने की भी इजाज़त नहीं हम को वर्ना
# हम जिधर जाते नए फूल खिलाते जाते
# मुझ को रोने का सलीक़ा भी नहीं है शायद
# लोग हँसते हैं मुझे देख के आते जाते
# अबकि मायूस हुआ यारों को रुख़्सत कर के
# जा रहे थे तो कोई ज़ख़्म लगाते जाते
# हम से पहले भी मुसाफ़िर कई गुज़रे होंगे
# कम से कम राह के पत्थर तो हटाते जाते
# मैं तो जलते हुए सहराओं का इक पत्थर था
# तुम तो दरिया थे मिरी प्यास बुझाते जाते
#  मुझे डुबो के बहुत शर्मसार रहती है
# मुझे डुबो के बहुत शर्मसार रहती है
# वो एक मौज जो दरिया के पार रहती है
# हमारे ताक़ भी बे-ज़ार हैं उजालों से
# दिए की लौ भी हवा पर सवार रहती है
# फिर उस के बा'द वही बासी मंज़रों के जुलूस
# बहार चंद ही लम्हे बहार रहती है
# इसी से क़र्ज़ चुकाए हैं मैंने सदियों से
# वो ज़िंदगी जो हमेशा उधार रहती है
# हमारी शहर के दानिशवरों से यारी है
# इसी लिए तो क़बा तार-तार रहती है
# मुझे ख़रीदने वालो ! क़तार में आओ
# वो चीज़ हूँ जो पस-ए-इश्तिहार रहती है
#  सवाल घर नहीं बुनियाद पर उठाया है
# सवाल घर नहीं बुनियाद पर उठाया है
# हमारे पाँव की मिट्टी ने सर उठाया है
# हमेशा सर पे रही इक चटान रिश्तों की
# ये बोझ वो है जिसे उम्र-भर उठाया है
# मिरी ग़ुलैल के पत्थर का कार-नामा था
# मगर ये कौन है जिस ने समर उठाया है
# यही ज़मीं में दबाएगा एक दिन हम को
# ये आसमान जिसे दोश पर उठाया है
# बुलंदियों को पता चल गया कि फिर मैं ने
# हवा का टूटा हुआ एक पर उठाया है
# महा-बली से बग़ावत बहुत ज़रूरी है
# क़दम ये हम ने समझ सोच कर उठाया है
#  नाम लिक्खा था आज किस-किस का
# नाम लिक्खा था आज किस-किस का
# "हाथ दस्ता हुआ है नर्गिस का"
# शाख पर उम्र कट गई गुल की
# बाग़ है जाने कौन बेहिस का
# ख़्वार फिरते हैं आइना होकर
# जाने मुंह देखना है किस किस का
# बुझ गये चांद सब हवेली के
# जल रहा है चिराग़ मुफ़लिस का
# सर पे रख कर ज़मीन फिरता हूँ
# साथ उसका है मैं नहीं जिस का
# 'मीर' जैसा था दो सदी पहले
# हाल अब भी वही है मजलिस का
#  जितने अपने थे, सब पराए थे
# जितने अपने थे, सब पराए थे
# हम हवा को गले लगाए थे
# जितनी कसमे थी, सब थी शर्मिंदा
# जितने वादे थे, सर झुकाये थे
# जितने आंसू थे, सब थे बेगाने
# जितने मेहमां थे, बिन बुलाए थे
# सब किताबें पढ़ी-पढ़ाई थीं
# सारे किस्से सुने-सुनाए थे
# एक बंजर जमीं के सीने में
# मैने कुछ आसमां उगाए थे
# सिर्फ दो घूंट प्यास कि खातिर
# उम्र भर धूप में नहाए थे
# हाशिए पर खड़े हूए है हम
# हमने खुद हाशिए बनाए थे
# मैं अकेला उदास बैठा था
# सामने कहकहे लगाए थे
# है गलत उसको बेवफा कहना
# हम कौन सा धुले-धुलाए थे
# आज कांटो भरा मुकद्दर है
# हमने गुल भी बहुत खिलाए थे
#  उँगलियाँ यूँ न सब पर उठाया करो
# उँगलियाँ यूँ न सब पर उठाया करो
# खर्च करने से पहले कमाया करो
# ज़िन्दगी क्या है खुद ही समझ जाओगे
# बारिशों में पतंगें उड़ाया करो
# दोस्तों से मुलाक़ात के नाम पर
# नीम की पत्तियों को चबाया करो
# शाम के बाद जब तुम सहर देख लो
# कुछ फ़क़ीरों को खाना खिलाया करो
# अपने सीने में दो गज़ ज़मीं बाँधकर
# आसमानों का ज़र्फ़ आज़माया करो
# चाँद सूरज कहाँ, अपनी मंज़िल कहाँ
# ऐसे वैसों को मुँह मत लगाया करो
#  पहली शर्त जुदाई है
# पहली शर्त जुदाई है
# इश्क़ बड़ा हरजाई है
# गुम हैं होश हवाओं के
# किस की खुशबू आई है
# ख़्वाब क़रीबी रिश्तेदार
# लेकिन नींद पराई है
# चांद तराशे सारी उमर
# तब कुछ धूप कमाई है
# मैं बिछड़ा हूँ डाली से
# दुनिया क्यों मुरझाई है
# दिल पर किसने दस्तक दी
# तुम हो या तन्हाई है
# दरिया दरिया नाप चुके
# मुट्ठी भर गहराई है
# सूरज टूट के बिखरा था
# रात ने ठोकर खाई है
# कोई मसीहा क्या जाने
# ज़ख़्म है या गहराई है
# वाह रे पागल वाह रे दिल
# अच्छी किसमत पाई है
#  दरमियाँ एक ज़माना रखा जाए
# दरमियां एक ज़माना रक्खा जाए
# तब कोई पल सुहाना रक्खा जाए
# सर पे सूरज सवार रहता है
# पीठ पर शामियाना रक्खा जाए
# तो यह अब तय हुआ कि अपने साथ
# कोई अपने सिवा न रक्खा जाए
# खूब बातें रहेंगी रस्ते भर
# धूप से दोस्ताना रक्खा जाए
# हों निगाहें ज़मीन पर लेकिन
# आसमां पर निशाना रक्खा जाए
# ज़ख़्म पर ज़ख़्म का गुमां न रहे
# ज़ख़्म इतना पुराना रक्खा जाए
# दिल लुटाने में एहतियात रहे
# यह ख़ज़ाना खुला न रक्खा जाए
# नील पड़ते रहें जबीनों पर
# पत्थरों को ख़फ़ा न रक्खा जाए
# यार! अब उस की बेवफ़ाई का
# नाम कुछ शायराना रक्खा जाए
#  मौसम की मनमानी है
# मौसम की मनमानी है
# आँखों आँखों पानी है
# साया साया लिख डालो
# दुनिया धूप कहानी है
# सब पर हँसते रहते हैं
# फूलों की नादानी है
# हाय ये दुनिया! हाय ये लोग
# हाय! यह सब कुछ फ़ानी है
# साथ इक दरिया रख लेना
# रस्ता रेगिस्तानी है
# कितने सपने देख लिये
# आँखों को हैरानी है
# दिलवाले अब कम कम हैं
# वैसे क़ौम पुरानी है
# बारिश, दरिया, सागर, ओस,
# आँसू पहला पानी है
# तुझ को भूले बैंठे हैं
# क्या ये कम क़ुर्बानी है
# दरिया हमसे आँख मिला
# देखें कितना पानी है
# दुनिया क्या है मुझसे पूछ
# मैंने दुनिया छानी है
#  नींदें क्या-क्या ख़्वाब दिखाकर ग़ायब हैं
# नींदें क्या-क्या ख़्वाब दिखाकर ग़ायब हैं
# आंखें तो मौजूद हैं मंज़र ग़ायब हैं
# बाक़ी जितनी चीज़ें थीं मौजूद हैं सब
# नक्शे में दो-चार समुन्दर ग़ायब हैं
# जाने ये तस्वीर में किसका लश्कर है
# हाथों में शमशीरें हैं सर ग़ायब हैं
# ग़ालिब भी है बचपन भी है शहरों में
# मजनूं भी है लेकिन पत्थर ग़ायब हैं
# धन्धेबाज़ मुजावर हाकिम बन बैठे
# दरगाहों से मस्त कलन्दर ग़ायब हैं
# दरवाज़ों पर दस्तक दें तो कैसे दें
# घर वाले मौजूद मगर घर ग़ायब हैं
#  शाम से पहले शाम कर दी है
# शाम से पहले शाम कर दी है
# क्या कहानी तमाम कर दी है
# आज सूरज ने मेरे आँगन में
# हर किरन बे नयाम कर दी है
# जिस से रहता है आसमां नाराज़
# वह ज़मीं मेरे नाम कर दी है
# दोपहर तक तो साथ चल सूरज
# तूने रस्ते में शाम कर दी है
# चेहरा-चेहरा हयात लोगों ने
# आईनों की गुलाम कर दी है
# क्या पढ़ें हम कि कुछ क़िताबों ने
# रोशनी तक हराम कर दी है
#  पुराने दाँव पर हर दिन नए आँसू लगाता है
# पुराने दाँव पर हर दिन नए आँसू लगाता है
# वो अब भी इक फटे रूमाल पर ख़ुश्बू लगाता है
# उसे कह दो कि ये ऊँचाइयाँ मुश्किल से मिलती हैं
# वो सूरज के सफ़र में मोम के बाज़ू लगाता है
# मैं काली रात के तेज़ाब से सूरज बनाता हूँ
# मिरी चादर में ये पैवंद इक जुगनू लगाता है
# यहाँ लछमन की रेखा है न सीता है मगर फिर भी
# बहुत फेरे हमारे घर के इक साधू लगाता है
# नमाज़ें मुस्तक़िल पहचान बन जाती है चेहरों की
# तिलक जिस तरह माथे पर कोई हिन्दू लगाता है
# न जाने ये अनोखा फ़र्क़ इस में किस तरह आया
# वो अब कॉलर में फूलों की जगह बिच्छू लगाता है
# अँधेरे और उजाले में ये समझौता ज़रूरी है
# निशाने हम लगाते हैं ठिकाने तू लगाता है
#  बढ़ गई है कि घट गई दुनिया
# बढ़ गई है कि घट गई दुनिया
# मेरे नक़्शे से कट गई दुनिया
# तितलियों में समा गया मंज़र
# मुट्ठियों में सिमट गई दुनिया
# अपने रस्ते बनाये खुद मैंने
# मेरे रस्ते से हट गई दुनिया
# एक नागन का ज़हर है मुझमे
# मुझको डस कर पलट गई दुनिया
# कितने खानों में बंट गए हम तुम
# कितनी हिस्सों में बंट गई दुनिया
# जब भी दुनिया को छोड़ना चाहा
# मुझसे आकर लिपट गई दुनिया
#  नदी ने धूप से क्या कह दिया रवानी में
# नदी ने धूप से क्या कह दिया रवानी में
# उजाले पाँव पटकने लगे हैं पानी में
# ये कोई और ही किरदार है तुम्हारी तरह
# तुम्हारा ज़िक्र नहीं है मिरी कहानी में
# अब इतनी सारी शबों का हिसाब कौन रखे
# बड़े सवाब कमाए गए जवानी में
# चमकता रहता है सूरज-मुखी में कोई और
# महक रहा है कोई और रात-रानी में
# ये मौज मौज नई हलचलें सी कैसी हैं
# ये किस ने पाँव उतारे उदास पानी में
# मैं सोचता हूँ कोई और कारोबार करूँ
# किताब कौन ख़रीदेगा इस गिरानी में
#  शाम होती है तो पलकों पे सजाता है मुझे
# शाम होती है तो पलकों पे सजाता है मुझे
# वह चिराग़ों की तरह रोज़ जलाता है मुझे
# मैं हूं ये कम तो नहीं है तेरे होने की दलील
# मेरा होना तेरा एहसास दिलाता है मुझे
# अब किसी शख़्स में सच सुनने की हिम्मत है कहां
# मुश्किलों ही से कोई पास बिठाता है मुझे
# कैसे महफ़ूज़ रखूं खुद को अजायब घर में
# जो भी आता है यहां हाथ लगाता है मुझे
# जाने क्या बनना है तुझको मेरी गीली मिट्टी
# कुज़ागर रोज़ बनाता है मिटाता है मुझे
# आब-ओ-दाना किसी बिगड़े हुए बच्चे की तरह
# मैं जहाँ शाख पे बैठूं के उड़ाता है मुझे
# वो मुझे मिल ना सका, इसकी शिकायत कैसी
# ये भी अहसान है कि, वो याद तो आता है मुझे
#  रात बहुत तारीक नहीं है
# रात बहुत तारीक नहीं है
# लेकिन घर नज़दीक नहीं है
# फूलों को समझा दे कोई
# हँसते रहना ठीक नहीं है
# तनकीदें बारीक हैं जितनी
# फ़न उतना बारीक नहीं है
# कोई ताज़ा शेर हो नाज़िल
# हक माँगा है भीक नहीं है
# दिन हैं जितने काले-काले
# रात उतनी तारीक नहीं है
# आज तुम्हारी याद न आई
# आज तबीअत ठीक नहीं है
#  मुझमें कितने राज़ हैं बतलाऊँ क्या
# मुझमें कितने राज़ हैं बतलाऊँ क्या
# बंद इक मुद्दत से हूँ, खुल जाऊँ क्या
# आजिज़ी, मिन्नत, ख़ुशामद, इल्तिज़ा
# और मैं क्या-क्या करूँ, मर जाऊँ क्या
# कल यहाँ मैं था जहाँ तुम आज हो
# मैं तुम्हारी ही तरह इतराऊँ क्या
# तेरे जलसे में तेरा परचम लिए
# सैकड़ों लाशें भी हैं, गिनवाऊँ क्या
# एक पत्थर है वो मेरी राह का
# गर ना ठुकराऊँ तो ठोकर खाऊँ क्या
# फिर जगाया तूने सोये शेर को
# फिर वही लहजादराज़ी, आऊँ क्या
#  उठी निगाह तो अपने ही रू-ब-रू हम थे
# उठी निगाह तो अपने ही रू-ब-रू हम थे
# ज़मीन आईना-ख़ाना थी चार-सू हम थे
# दिनों के बाद अचानक तुम्हारा ध्यान आया
# ख़ुदा का शुक्र कि उस वक़्त बा-वज़ू हम थे
# वो आईना तो नहीं था पर आईने सा था
# वो हम नहीं थे मगर यार हू-ब-हू हम थे
# ज़मीं पे लड़ते हुए आसमाँ के नर्ग़े में
# कभी कभी कोई दुश्मन कभू कभू हम थे
# हमारा ज़िक्र भी अब जुर्म हो गया है वहाँ
# दिनों की बात है महफ़िल की आबरू हम थे
# ख़याल था कि ये पथराव रोक दें चल कर
# जो होश आया तो देखा लहू लहू हम थे
#  मसअला प्यास का यूं हल हो जाए
# मसअला प्यास का यूं हल हो जाए
# जितना अमृत है हलाहल हो जाए
# शहर-ए-दिल में है अजब सन्नाटा
# तेरी याद आए तो हलचल हो जाए
# ज़िन्दगी एक अधूरी तस्वीर
# मौत आए तो मुकम्मल हो जाए
# और एक मोर कहीं जंगल में
# नाचते-नाचते पागल हो जाए
# थोड़ी रौनक है हमारे दम से
# वरना ये शहर तो जंगल हो जाए
# फिर खुदा चाहे तो आंखें ले ले
# बस मेरा ख़्वाब मुकम्मल हो जाए
#  वो कभी शहर से गुज़रे तो ज़रा पूछेंगे
# वो कभी शहर से गुज़रे तो ज़रा पूछेंगे
# ज़ख़्म हो जाते हैं किस तरह दवा पूछेंगे
# गुम न हो जाएं मकानों के घने जंगल में
# कोई मिल जाये तो हम घर का पता पूछेंगे
# मेरे सच से उन्हें क्या लेना है मैं जानता हूँ
# हाथ कुरआन पे रखवा के वह क्या पूछेंगे
# ये रहा नामा-ए-आमाल मगर तुझ से भी
# कुछ सवालात तो हम भी ऐ ख़ुदा पूछेंगे
# वह कहीं किरनें समेटे हुए मिल जायेगा
# कब रफू होगी उजाले की क़बा पूछेंगे
# वह जो मुंसिफ़ है तो क्या कुछ भी सज़ा दे देगा
# हम भी रखते हैं ज़ुबां पहले ख़ता पूछेंगे
#  नज़ारा देखिये कलियों के फूल होने का
# नज़ारा देखिये कलियों के फूल होने का
# यही है वक्त दुआएं क़बूल होने का
# उन्हें बताओ के ये रास्ते सलीब के हैं
# जो लोग करते हैं दावा रसूल होने का
# तमाम उम्र गुज़रने के बाद दुनिया में
# पता चला हमें अपने फुजूल होने का
# उसूल वाले हैं बेचारे इन फ़रिश्तों ने
# मज़ा चखा ही नहीं बे उसूल होने का
# है आसमां से बुलन्द उसका मर्तबा जिसको
# शर्फ़ है आप के कदमों की धूल होने का
# चलो फ़लक पे कहीं मन्ज़िलें तलाश करें
# ज़मीं पे कुछ नहीं हासिल हसूल होने का
#  अंदर का ज़हर चूम लिया धुल के आ गए
# अंदर का ज़हर चूम लिया धुल के आ गए
# कितने शरीफ़ लोग थे सब खुल के आ गए
# सूरज से जंग जीतने निकले थे बेवक़ूफ़
# सारे सिपाही मोम के थे घुल के आ गए
# मस्जिद में दूर दूर कोई दूसरा न था
# हम आज अपने आप से मिल-जुल के आ गए
# नींदों से जंग होती रहेगी तमाम उम्र
# आँखों में बंद ख़्वाब अगर खुल के आ गए
# सूरज ने अपनी शक्ल भी देखी थी पहली बार
# आईने को मज़े भी तक़ाबुल के आ गए
# अनजाने साए फिरने लगे हैं इधर उधर
# मौसम हमारे शहर में काबुल के आ गए
#  मौसम बुलाएंगे तो सदा कैसे आएगी
# मौसम बुलाएंगे तो सदा कैसे आएगी
# सब खिड़कियां हैं बन्द हवा कैसे आएगी
# मेरा खुलूस इधर है उधर है तेरा गुरूर
# तेरे बदन पे मेरी क़बा कैसे आएगी
# रस्ते में सर उठाए हैं रस्मों की नागिनें
# ऐ जान ए इन्तज़ार! बता कैसे आएगी
# सर रख के मेरे ज़ानों पे सोई है ज़िन्दगी
# ऐसे में आई भी तो कज़ा कैसे आएगी
# आंखों में आंसूओं को अगर हम छुपाएंगे
# तारों को टूटने की सदा कैसे आएगी
# वह बे वफ़ा यहां से भी गुजरा है बारहा
# इस शहर की हदों में वफ़ा कैसे आएगी
#  यहाँ कब थी जहाँ ले आई दुनिया
# यहाँ कब थी जहाँ ले आई दुनिया
# यह दुनिया को कहाँ ले आई दुनिया
# ज़मीं को आसमानों से मिला कर
# ज़मीं पर आसमां ले आई दुनिया
# मैं ख़ुद से बात करना चाहता था
# ख़ुदा को दरमियां ले आई दुनिया
# चिराग़ों की लवें सहमी हुई हैं
# सुना है आँधियां ले आई दुनिया
# जहां मैं था वहां दुनिया कहां थी
# वहां मैं हूँ जहां ले आई दुनिया
# तवक़्क़ो हमने की थी शाखे-गुल की
# मगर तीरो कमाँ ले आई दुनिया
#  ज़िंदगी की हर कहानी बे-असर हो जाएगी
# ज़िंदगी की हर कहानी बे-असर हो जाएगी
# हम न होंगे तो ये दुनिया दर-ब-दर हो जाएगी
# पाँव पत्थर कर के छोड़ेगी अगर रुक जाइए
# चलते रहिए तो ज़मीं भी हम-सफ़र हो जाएगी
# जुगनुओं को साथ ले कर रात रौशन कीजिए
# रास्ता सूरज का देखा तो सहर हो जाएगी
# ज़िंदगी भी काश मेरे साथ रहती उम्र-भर
# ख़ैर अब जैसे भी होनी है बसर हो जाएगी
# तुम ने ख़ुद ही सर चढ़ाई थी सो अब चक्खो मज़ा
# मैं न कहता था कि दुनिया दर्द-ए-सर हो जाएगी
# तल्ख़ियाँ भी लाज़मी हैं ज़िंदगी के वास्ते
# इतना मीठा बन के मत रहिए शकर हो जाएगी
#  बरछी लेकर चाँद निकलने वाला है
# बरछी ले कर चांद निकलने वाला है
# घर चलिए अब सूरज ढलने वाला है
# मंज़रनामा वही पुराना है लेकिन
# नाटक का उनवान बदलने वाला है
# तौर तरीके बदले नरम उजालों ने
# हर जुगनू अब आग उगलने वाला है
# धूप के डर से कब तक घर में बैठोगे
# सूरज तो हर रोज निकलने वाला है
# एक पुराने खेल खिलौने जैसी है
# दुनिया से अब कौन बहलने वाला है
# दहशत का माहौल है सारी बस्ती में
# क्या कोई अख़बार निकलने वाला है
#  तेरा मेरा नाम ख़बर में रहता था
# तेरा मेरा नाम ख़बर में रहता था
# दिन बीते, एक सौदा सर में रहता था
# मेरा रस्ता तकता था एक चांद कहीं
# मैं सूरज के साथ सफ़र में रहता था
# सारे मंज़र गोरे-गोरे लगते थे
# जाने किस का रूप नज़र में रहता था
# मैंने अक्सर आंखें मूंद के देखा है
# एक मंज़र जो पस-मंज़र म रहता था
# काठ की कश्ती पीठ थपकती रहती थी
# दरियाओं का पांव भंवर में रहता था
# उजली उजली तस्वीरें सी बनती हैं
# सुनते हैं अल्लाह बशर में रहता था
# मीलों तक हम चिड़ियों से उड़ जाते थे
# कोई मेरे साथ सफ़र में रहता था
# सुस्ताती है गर्मी जिस के साये में
# ये पौधा कल धूप नगर में रहता था
# धरती से जब खुद को जोड़े रहते थे
# ये सारा आकाश असर में रहता था
# सच का बोझ उठाये हूँ अब पलकों पर
# पहले मैं भी ख़्वाब नगर में रहता था
#  इक नया मौसम नया मंज़र खुला
# इक नया मौसम नया मंज़र खुला
# कोई दरवाज़ा मेरे अन्दर खुला
# एक ग़ज़ल कमरे की छत पर मुन्तसिर
# एक कलम रखा है काग़ज़ पर खुला
# लेकिन उड़ने की सकत बाकी नहीं
# है कई दिन से क़फस का दर खुला
# चलते रहने का इरादा शर्त है
# जब भी दीवारें उठी हैं दर खुला
# हो गया ऐलान फिर एक जंग का
# जितने वक़्फ़े में मेरा बकतर खुला
# साथ रहता है यही एहसास-ए-जुर्म
# किस के ज़िम्मे छोड़ आये घर खुला
# अब मयस्सर ही कहां वह तन लेहाफ़
# अब कहां रहता हूं मैं शब भर खुला
# मैं ख़ुद अपने आप ही में बन्द था
# मुद्दतों के बाद ये मुझ पर खुला
# उम्र भर की नींद पूरी हो चुकी
# तब कहीं जाकर मेरा बिस्तर खुला
# कौन वह मिर्ज़ा असदुल्लाह खां
# मुझ से वह तन्हाई में अक्सर खुला
#  मौसमों का ख़याल रक्खा करो
# मौसमों का ख़याल रक्खा करो
# कुछ लहू मैं उबाल रक्खा करो
# ज़िंदग़ी रोज़ मरती रहती है
# ठीक से देख-भाल रक्खा करो
# सब लकीरों पे छोड़ रक्खा है
# आप भी कुछ कमाल रक्खा करो
# याद करते रहा करो माज़ी
# इक-इक पल उजाल रक्खा करो
# जाने कब सच का सामना हो जाए
# कोई रस्ता निकाल रक्खा करो
# ग़ालिबों को रखो दिमाग़ों में
# दिल यग़ाना मिसाल रक्खा करो
# सुल्ह करते रहा करो हरदम
# दुश्मनों को निकाल रक्खा करो
# ख़ाली-ख़ाली उदास-उदास आँखें
# इनमें कुछ ख़्वाब पाल रक्खा करो
# फिर वो चाकू चला नहीं सकता
# हाथ गरदन में डाल रक्खा करो
# लाख सूरज से दोस्ताना हो
# चंद जुगनू भी पाल रक्खा करो
#  मुआफ़िक़ जो फ़िज़ा तैयार की है
# मुआफ़िक़ जो फ़िज़ा तैयार की है
# बड़ी तदबीर से हमवार की है
# यहाँ तुझ-मुझ के हिस्से में ज़ियां है
# ये दुनिया दरहमो-दीनार की है
# यक़ीं कैसे करूं मैं मर चुका हूँ
# मगर सुर्खी यही अख़बार की है
#  चराग़ों का घराना चल रहा है
# चराग़ों का घराना चल रहा है
# हवा से दोस्ताना चल रहा है
# जवानी की हवाएँ चल रही हैं
# बुज़ुर्गों का ख़ज़ाना चल रहा है
# मिरी गुम-गश्तगी पर हँसने वालो
# मिरे पीछे ज़माना चल रहा है
# अभी हम ज़िंदगी से मिल न पाए
# तआरुफ़ ग़ाएबाना चल रहा है
# नए किरदार आते जा रहे हैं
# मगर नाटक पुराना चल रहा है
# वही दुनिया वही साँसें वही हम
# वही सब कुछ पुराना चल रहा है
# ज़्यादा क्या तवक़्क़ो हो ग़ज़ल से
# मियाँ, बस आब-ओ-दाना चल रहा है
# समुंदर से किसी दिन फिर मिलेंगे
# अभी पीना-पिलाना चल रहा है
# वही महशर वही मिलने का व'अदा
# वही बूढ़ा बहाना चल रहा है
# यहाँ इक मदरसा होता था पहले
# मगर अब कार-ख़ाना चल रहा है
#  तूफ़ां तो इस शहर में अक्सर आता है
# तूफ़ां तो इस शहर में अक्सर आता है
# देखें अबकि किस का नम्बर आता है
# यारों के भी दाँत बहुत ज़हरीले हैं
# पर हमको भी साँपों का मंतर आता है
# सूखे बादल होंठों पर कुछ लिखते हैं
# आँखों में सैलाब का मंज़र आता है
# तक़रीरों में सबके जौहर खुलते हैं
# अंदर जो पलता है बाहर आता है
# बच कर रहना, इक क़ातिल इस बस्ती में
# काग़ज़ की पोशाक पहनकर आता है
# बोता है वो रोज़ तअफ़्फ़ुन ज़हनों में
# जो कपड़ों पर इत्र लगाकर आता है
# रहमत मिलने आती है पर फैलाए
# पलकों पर जब कोई पयम्बर आता है
# सूख चुका हूँ फिर भी मेरे साहिल यर
# पानी लेने रोज समुन्दर आता है
# उन आँखों की नींदें गुम हो जाती हैं
# जिन आँखों को ख़्वाब मयस्सर आता है
#  ख़ाक से बढ़कर कोई दौलत नहीं होती
# ख़ाक से बढ़कर कोई दौलत नहीं होती
# छोटी मोटी बात पे हिज़रत नहीं होती
# पहले दीप जलें तो चर्चे होते थे
# और अब शहर जलें तो हैरत नहीं होती
# तारीखों की पेशानी पर मोहर लगा
# ज़िंदा रहना कोई करामात नहीं होती
# सोच रहा हूँ आखिर कब तक जीना है
# मर जाता तो इतनी फुर्सत नहीं होती
# रोटी की गोलाई नापा करता है
# इसी लिए तो घर में बरकत नहीं होती
# हमने ही कुछ लिखना पढ़ना छोड़ दिया
# वरना ग़ज़ल की इतनी किल्लत नहीं होती
# मिसवाकों से चाँद का चेहरा छूता है
# बेटा ! इतनी सस्ती जन्नत नहीं होती
# बाजारों में ढूंढ रहा हूँ वो चीज़े
# जिन चीजों की कोई कीमत नहीं होती
# कोई क्या राय दे हमारे बारे में
# ऐसों वैसों की तो हिम्मत नहीं होती
#  ज़मीं बालिश्त भर होगी हमारी
# ज़मीं बालिश्त भर होगी हमारी
# यहाँ कैसे बसर होगी हमारी
# ये काली रात होगी ख़त्म किस दिन
# न जाने कब सहर होगी हमारी
# इसी उम्मीद पर ये रतजगे हैं
# किसी दिन रात भर होगी हमारी
# दरे-मस्जिद पे कोई शय पड़ी है
# दुआ-ए-बेअसर होगी हमारी
# चला हूँ गुमरही को साथ लेकर
# यही तो हमसफ़र होगी हमारी
# न जाने दिन कहाँ निकलेगा अपना
# न जाने शब किधर होगी हमारी
# दुआ मांगेंगे कब तक आस्मा से
# ज़मीं कब मोतबर होगी हमारी
# ये दुनिया कहकशां कहती है जिसको
# कभी ये रहगुज़र होगी हमारी
# चुभे हैं किस कदर तलुवों में कंकर
# सितारों पर नज़र होगी हमारी
# बिछड़ने में ही शायद अब मज़ा है
# ख़ुशी  में आँख तर होगी हमारी
#  ये आईना फ़साना हो चुका है
# ये आईना फ़साना हो चुका है
# तुझे देखे ज़माना हो चुका है
# वतन के मौसमों अब लौट आओ
# तुम्हें देखे ज़माना हो चुका है
# दवाएँ क्या, दवा क्या, बद्दुआ क्या
# सभी कुछ ताजिराना हो चुका है
# अब आंसू भी पुराने हो चुके हैं
# समन्दर भी पुराना हो चुका है
# चलो दीवाने-ख़ास अब काम आया
# परिन्दों का ठिकाना हो चुका है
# वही वीरानियां हैं शहरे-दिल में
# यहाँ पहले भी आना हो चुका है
# तेरी मसरूफ़ियत हम जानते हैं
# मगर मौसम सुहाना हो चुका है
# मोहब्बत में ज़रूरी हैं वफ़ाएँ
# यह नुस्ख़ा अब पुराना हो चुका है
# चलो अब हिज्र का भी हम मज़ा लें
# बहुत मिलना मिलाना हो चुका है
# हजारों सूरतें रोशन हैं दिल में
# यह दिल आईना ख़ाना हो चुका है
# बची हैं गिनती की चंद साँसें
# इस घर का बयाना हो चुका है।
# '''

# def preprocess_poem(text):
#     text = text.replace("\n", " <NL> ")
#     text = text.replace("।", " <DANDA> ")
#     text = re.sub(r"[^\u0900-\u097F <>A-Z_]", " ", text)
#     text = re.sub(r"\s+", " ", text)
#     return text.strip()

# processed_text = preprocess_poem(data)

# tokenizer=Tokenizer(filters=" ",lower=False)
# tokenizer.fit_on_texts([processed_text])
# total_words=len(tokenizer.word_index)+1
# sequence=tokenizer.texts_to_sequences([processed_text])[0]

# X,y=[],[]
# for i in range(1,len(sequence)):
#   X.append(sequence[:i])
#   y.append(sequence[i])
# max_len=max(len(x) for x in X)
# X=pad_sequences(X,maxlen=max_len,padding="pre")
# y=tf.keras.utils.to_categorical(y,num_classes=total_words)

# model = tf.keras.Sequential([
#     tf.keras.layers.Embedding(total_words, 100, input_length=max_len),
#     tf.keras.layers.LSTM(150),
#     tf.keras.layers.Dense(total_words, activation="softmax")
# ])
# model.compile(
#     loss="categorical_crossentropy",
#     optimizer="adam"
# )
# model.fit(X,y,epochs=50,batch_size=64)

